[
  {
    "id": 1,
    "title": "A DIVINE CALL TO HOLY WOMEN FOR ENDTIME GOSPEL EXPLOIT edited",
    "image": "https://firebasestorage.googleapis.com/v0/b/fsv-multimedia-online-radio.appspot.com/o/bookcover%2Fdivinecall.jpg?alt=media&token=5d84b8eb-6b1c-4f2e-98c1-bc715fcd6f37",
    "audio": "",
    "bookcontent": "A DIVINE CALL TO HOLY WOMEN FOR ENDTIME GOSPEL EXPLOIT.\n\nA DIVINE CALL TO HOLY WOMEN FOR ENDTIME\nGOSPEL EXPLOITS\nCopyright © Pastor Paul Rika 2019\nISBN:\nPrinted, published and distributed by\nHOLINESS REVIVAL MINISTRY WORLDWIDE\na.k.a. HOLINESS REVIVAL MOVEMENT\nWORLDWIDE (HOREMOW)\nBehind Federal Government College, Kwali,\nFCT, Abuja, Nigeria.\n+234(0) 8169023948; +234(0)8056834323\nEmail: holiinessrevivalmovement@gmail.com\nWebsite: www.holinessrevivalmovementworldwide.com\n\nINTRODUCTION\nWe all attest to the present situation of the churches of God everywhere in the world. There is no time we need more labourers in the field of evangelism and gospel service than now. But observing the characteristics of men in Christ's Churches, we notice to our dismay that the men are asleep in sin; the men are afraid of confronting the roaring Satan; hence the men are absent from the churches of God. This is true because a look at weekly church activities and worship will show you that men are scanty and the women are more in number. The few men available are not zealous or vibrant.\nThese are the days of Deborah; the Lord is raising women and pouring His Spirit upon them for end time ministry and gospel exploits. Let the men be jealous of this and repent of their lukewarmness and lethargy. This book is written to give women Spirit led inspiration and motivation for the gospel ministry. The Lord who is calling His daughters to Christian ministry in all respects will be with them and will make them fruitful in the field of His service. Expect great revival from Christian women of our time. The Lord is on His way. \nMatthew 28 verse 18 to 20\n\t“And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth. \nGo ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost: \n\tTeaching them to observe all things whatsoever I have commanded you: and, lo, I am with you always, even unto the end of the world. Amen.”\n\nCHAPTER ONE\n Priscilla was a daughter of God and the wife of Aquila.  Both of them were great ministers of the gospel of our Lord Jesus Christ.  They became prominent under the ministry of Apostle Paul.\n\n1.1 Priscilla's Acquaintance with Paul\n\nActs 18 verse1 to3\n\n “After these things Paul departed from Athens, and came to Corinth;\n\n And found a certain Jew named Aquila, born in Pontus, lately come from Italy, with his wife Priscilla; (because that Claudius had commanded all Jews to depart from Rome:) and came unto them.\n\nAnd because he was of the same craft, he abode with them, and wrought: for by their occupation they were tentmakers.”\n\nPaul the Apostle became acquainted with Aquila and Priscilla in Corinth when he came there for gospel work. He got attracted to them and stayed with them because they were into the same profession of tent-making, hence they had a good long stay together. That was a great\nprivilege to Aquila household. Paul the apostle was a nobleman of wisdom, full of grace, insight, and passion for God. He had a great calling and sold himself for the gospel of our Lord Jesus Christ. Living in the same house and compound with such a person was a rare privilege Priscilla took cognizance of and grabbed with both hands.\n\nIn a similar account, the Shunammite woman perceived that Elisha was not an ordinary man, but a great and holy prophet of God that deserved special honour. She said to her husband,\n\n“I perceive that this is a holy man of God”.\n\nElisha was passing by their house on a regular basis. The Shunammite woman and her husband agreed to provide accommodation for Elisha in their house any time he came around. Elisha's presence in that house turned the situation of the woman around as she gave birth to a child after many years of barreness. In the case of Priscilla, she was not barren but hungry for God. Her hunger and thirst for God received satisfaction as she took full advantage of her friendly interaction with Apostle Paul.\n\nProverbs 13 verse 20\n\n“He that walketh with wise men shall be wise: but a companion of fools shall be destroyed.”\n\n1.2 Priscilla Was a Faithful Student Under\n\nPaul's Mentorship\n\nPhilippians 4 verse 9\n\n“Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.”\n\nTo be effective and fruitful in the Christian life and ministry you should learn from those the Lord has advanced, who have proven testimony of holy Christian life and ministry.\n\nHebrews 13 verse 7\n\n Remember them which have the rule over you, who have spoken unto you the word of God: whose faith follow, considering the end of their conversation.\n\nPhilippians 3 verse 17\n\n Brethren, be followers together of me, and mark them which walk so as ye have us for an ensample.\n\nPeople should take advantage of the truth that comes out of these true ministers of the gospel in order to be blessed. It will be miserable for one to be married to a true minister of God and yet miss the privilege of entering heaven.\n\nGenesis 19 verse 26\n\n But his wife looked back from behind him, and she became a pillar of salt.\n\nPriscilla remains a good example. She allowed herself to be mentored by Apostle Paul when Paul was residing at her house in Corinth. Priscilla took advantage of that opportunity along with Aquila to listen to Paul and did whatever he instructed her to do. The Holy Scripture shows how Priscilla sacrificed her house for the gospel of our Lord Jesus Christ in order to reach out to others. There is a blessed reward when you obey and humble yourself under true and genuine ministers of the gospel.\n\nJames 1 verse 22 to 25\n\n“ But be ye doers of the word, and not hearers only, deceiving your own selves.\n\n For if any be a hearer of the word, and not a doer, he is like unto a man beholding his natural face in a glass:\nFor he beholdeth himself, and goeth his way, and straightway forgetteth what manner of man he was.\n\nBut whoso looketh into the perfect law of liberty, and continue therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed.”\n\nPriscilla was not a hypocrite like the Pharisees. The Pharisees built the graves of prophets and painted them white to honour God but inwardly practiced deceit. They claimed that if it were in their days, they would not have killed the prophets of God as did their fathers. In other words, they would have treated the prophets nicely and with respect. By character, Pharisees are usually self-righteous people, full of hypocrisy. Jesus examined their hearts and pronounced woe on them. The Pharisees on several occasions attempted to kill Jesus, the greatest of all prophets. Aquila and Priscilla were different. They were perfect examples of obedient children of God. They demonstrated humility and supported the work of God as carried out by the Apostle Paul. We desire that woman in Holiness Movement should submit to the teachings and mentorship of Holiness Revival Movement and her leadership; They should live genuine Christian lives, without hypocrisy.\n\n1.3\tPaul Commended Pricilla and Aquila\n\n1 Corinthians 16 verse19\n\n“ The churches of Asia salute you. Aquila and Priscilla salute you much in the Lord, with the church that is in their house.”\n\nPaul on behalf of Priscilla and Aquila, extended a special salutation to the church of Corinth in an expression of the friendly role the two played by accommodating the church in their house for the salvation of souls. Paul counted Priscilla and Aquila as worthy, righteous and faithful disciples in their service to God. He counted them worthy by mentioning their names in the Book of eternity, the holy Bible. Priscilla and Aquila were co-workers with Paul in the propagation of the gospel of our Lord Jesus Christ. Follow God wholeheartedly along with your believing husband. Open your house to the worship of God.\n\nRomans 16 verse 3 to 4\n\n“ Greet Priscilla and Aquila my helpers in Christ Jesus:\n Who have for my life laid down their own necks: unto whom not only I give thanks, but also all the churches of the Gentiles.”\n\nSeveral scripture references show that Priscilla's name appeared ahead of her husband's in Paul's letters. This may be due to the prominent role she played and her commitment to the gospel work. In one of such instances, Priscilla and Aquila accompanied Paul to Ephesus for gospel work and this was duly acknowledged by Paul. Engage yourself in soul winning activities as Priscilla did.\n\n\nCHAPTER TWO\n\nPRISCILLA WAS HIGHLY COMMITTED TO THE GOSPEL WORK\n\nActs 18 verse18 to19\n\n“And Paul after this tarried there yet a good while, and then took his leave of the brethren, and sailed thence into Syria, and with him Priscilla and Aquila; having shorn his head in Cenchrea: for he had a vow.\n\n And he came to Ephesus, and left them there: but he himself entered into the synagogue, and reasoned with the Jews.”\n\nPaul took with him Priscilla and Aquila on his trip to Syria and Ephesus. This showed the level of their commitment.\n\n2.1.  Priscilla Served  God  Wholeheartedly\n\nWithout Excuse\n\nMany women give complaints and excuses concerning God's work.\n\nPriscilla's actions in the gospel work with Paul showed that she was not a careless or selfish woman in her quest to serve the Lord. She was desirous to serve God regardless of the potential risks. Her heart was in total submission to the Lord. In today's context, some gospel ministers' wives may choose to take the back seat by giving unworthy excuses to their God-fearing husbands rather than cooperating with them in the gospel work. Such women do not want to take risks and always look for the slightest excuses to avoid doing the work of God. A case in point is the wife of one of my coordinators who gave me an excuse when I asked her to teach in a Bible Study class. She sent me a text message saying that she could not teach in a crowd due to shyness. The Lord spoke to me that I should insist and make her do the task assigned. She ended up teaching in that Bible Study class and she did well. This tells us that there are privileges that God brings to your way and you must not play shyness or timidity at them. Do not excuse yourself from God's precious work!\n\nJeremiah 1 verse 4 to10\n\n“Then the word of the LORD came unto me, saying,\n\nBefore I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations.\n\n Then said I, Ah, Lord GOD! behold, I cannot speak: for I am a child.\n But the LORD said unto me, Say not, I am a child: for thou shalt go to all that I shall send thee, and whatsoever I command thee thou shalt speak.\nBe not afraid of their faces: for I am with thee to deliver thee, saith the LORD. Then the LORD put forth His hand, and touched my mouth. And the LORD said unto me, Behold, I have put My words in thy mouth.\n\n\n See, I have this day set thee over the nations and over the kingdoms, to root out, and to pull down, and to destroy, and to throw down, to build, and to plant”.\n\nWives of Christian leaders should stop giving excuses in the ministry work. Priscilla never gave excuses for the gospel work. She was always supportive and loyal to the gospel work with Paul along with her husband, Aquila. Righteousness, holiness, and truth is in your hands. Do not deprive people of it. Priscilla and Aquila made use of the privilege they had with Paul. The Act of the Apostle shows that Priscilla was the source of inspiration for her husband's commitment to the gospel work with Paul. Priscilla's name was given higher priority over her husband's name three times in the scriptures under Paul's ministry. Theologians reasoned that Pricilla's name was more pronounced in the scriptures than her husband's to indicate the higher grace and commitment in her.\n\n Second Timothy 4 verse 19\n\n “Salute Prisca and Aquila, and the household of Onesiphorus.”\n\n\n2.2.\tPriscilla Was Steadfast with Paul to the End \n\nPriscilla and Aquila continued to work with Paul, until the last day of his ministry work on earth.\n\n\n Second Timothy 4 verse 6 to 8 ,16 to 19\n\n“For I am now ready to be offered, and the time of my departure is at hand.\n\nI have fought a good fight, I have finished my course, I have kept the faith:\n\nHenceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day:\nand not to me only, but unto all them also that love His appearing.\n\n  At my first answer no man stood with me, but all men forsook me: I pray God that it may not be laid to their charge.\n\n Notwithstanding the Lord stood with me, and strengthened me; that by me the preaching might be fully known, and that all the Gentiles might hear: and I was delivered out of the mouth of the lion.\n\n And the Lord shall deliver me from every evil work, and will preserve me unto His heavenly kingdom: to whom be glory for ever and ever. Amen.\n\n Salute Prisca and Aquila, and the household of Onesiphorus.”\n\nPaul knew that his service in the gospel work was coming to an end and he was prepared to meet Jesus Christ in heaven. The scripture reference above equally shows Priscilla's steadfastness with her husband in support of the gospel work with Paul to the end. Holy women should stand steadfast in the gospel work with their husbands to the end. In other words, women should be inspirers of their husbands in the gospel work as did Priscilla. There should be no backsliding until death or rapture. God has put grace in your life to support your husband in the ministry work. Be faithful to God and your husband.\n\nFirst Peter 3 verse 5 to 6\n\n“For after this manner in the old time the holy women also, who trusted in God, adorned themselves, being in subjection unto their own husbands:\n\nEven as Sara obeyed Abraham, calling him lord: whose daughters ye are, as long as ye do well, and are not afraid with any amazement.”\n\n\nA story was told of a faithful woman whose husband was arrested for preaching the gospel of Christ in a communist country. The threat from the communist government did not prevent her from supporting her husband to the end. The husband was taken to prison and judgment was passed on him to deny Jesus or face a death sentence. As this was going on, the woman requested to see her husband in prison. The woman stood as an inspirer to her husband and ensured he did not deny Jesus for any reason.\n\nShe was ready for widowhood for Christ's sake. She inspired her husband not to deny Jesus in the prison, but to resist the devil to the end. As the Lord would have it, the woman was allowed to see her husband in the prison by the communist government. She was allowed to visit the prison in the hope of persuading her husband to deny Jesus. When she entered the prison, she met her husband and encouraged him not to deny Jesus in spite of the death penalty hanging on his neck. When the government officials noticed that she was rather encouraging her husband to remain firm in his conviction for Christ, they threatened to execute her along with her husband. She told them that was good news because it would give her the rare privilege of dying the same day with her husband and being forever with their blessed Lord and Saviour Jesus Christ in heaven. All persuasions to convince them to deny Jesus failed.\n\nMay such a spirit of steadfast and unfailing faith that will make you to stand for Jesus at the risk of your life come upon you. This was how Priscilla and Aquila remained steadfast to the end. Note that the Bible says nothing about their children. We do not know whether they had children or not. What was most important of them and worthy of eternal mention was their faithful Christian life and ministry.\n\nRomans 8 verse 35 to 39\n\n“Who shall separate us from the love of Christ? shall tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword? \n\nAs it is written, for thy sake we are killed all the day long; we are accounted as sheep for the slaughter. \n\nNay, in all these things we are more than conquerors through him that loved us. \n\nFor I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, Nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord.” \n\n2.3. Priscilla Patterned Her Life After Paul,\n\nHer Mentor\n\nPriscilla knew the discipline of Paul's ministry and also understood the truth of the gospel. She followed the pattern of Paul in ministry and endured the sufferings attached to the gospel.\n\nPhilippians 4 verse 9\n\n“Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.”\n\nPriscilla was a preacher and teacher of sound doctrine. She preached the full gospel: salvation from sin, sanctification of heart, baptism with the Holy Spirit, evidenced by speaking in tongues. She taught restitution: correcting past wrong doing; she taught standard Christian marriage, one man, one wife till death of either party, tithe payment, righteousness, holiness and truth in business and in human relationship. As a passionate soul winner, she persuaded believers to win souls for Christ and be ready for Christ’s return. Being an example herself she taught wives’ submission to their own husbands in everything and husbands love for their wives, parent’s care for children and children's obedience to their parents. She learned these and other gospel truth from Paul her mentor.\n\nTitus 2 verse 1\n\n“ But speak thou the things which become sound doctrine:”\n\n First Timothy 4 verse15 and16\n\n“Meditate upon these things; give thyself wholly to them; that thy profiting may appear to all.\n\n Take heed unto thyself, and unto the doctrine; continue in them: for in doing this thou shalt both save thyself, and them that hear thee.”\n\nWomen who have learned and are learning the doctrine and discipline of truth, righteousness and holiness should spread same in their society and in the world.\n\nMany of the people at that time were new converts in Christ. They never knew the truth of the gospel. But Priscilla was a true disciple of Paul in life and doctrine. She practiced the constant life of righteousness and holiness as a Christian and holiness preacher. She dressed holy. She did not use jewelry to adore herself nor engaged in fanciful hairdo.\n\n First Thessalonians 2 verse10\n\n“Ye are witnesses, and God also, how holily and justly and unblameably we behaved ourselves among you that believe:”\n\nSecond Timothy 1 verse 13 to15\n\n“Hold fast the form of sound words, which thou hast heard of me, in faith and love which is in Christ Jesus.\n\n That good thing which was committed unto thee keep by the Holy Ghost which dwelleth in us.\n\nThis thou knowest, that all they which are in Asia be turned away from me; of whom are Phygellus and Hermogenes.”\n\nPaul was a practical example of a true minister of God. Priscilla emulated Paul's example in reaching out to perishing souls. She was zealous for Jesus and learned much revelation of truth from Paul.\n\nSecond Timothy 2 verse 2\n\n“And the things that thou hast heard of me among many witnesses, the same commit thou to faithful men, who shall be able to teach others also.”\n\nThe doctrines and practices you have learned from true Christian ministers should be passed onward to others.\n\nCHAPTER THREE\nPRISCILLA BECAME A MENTOR HERSELF\n\n3.1 Priscilla Mentored Apollos\n\nPriscilla and Aquila came across Apollos who did not have full knowledge of the gospel message. Apollos only knew about the baptism of John. They reached out to perfect him in Christ.\n\nActs 18 verse 24 to 28\n\n“ And a certain Jew named Apollos, born at Alexandria, an eloquent man, and mighty in the scriptures, came to Ephesus.\n\nThis man was instructed in the way of the Lord; and being fervent in the spirit, he spake and taught diligently the things of the Lord, knowing only the baptism of John.\n\n And he began to speak boldly in the synagogue: whom when Aquila and Priscilla had heard, they took him unto them, and expounded unto him the way of God more perfectly.\n\n And when he was disposed to pass into Achaia, the brethren wrote, exhorting the disciples to receive him: who, when he was come, helped them much which had believed through grace:\n For he mightily convinced the Jews, and that publickly, shewing by the scriptures that Jesus was Christ.”\n\nApollos spoke well of Christ but knew little of the truth of the gospel. He was a zealous man but lacked adequate knowledge of the message of the gospel. Priscilla and Aquila found Apollos as a potential material for the gospel work. They took him aside and tutored him to make him understand the gospel truth clearly. Apollos was a humble man. He did not resist the mentorship of a woman. This made Apollos to become a great preacher of the gospel of our Lord Jesus Christ.\n\nActs 19 verse1 to 4\n\n“And it came to pass, that, while Apollos was at Corinth, Paul having passed through the upper coasts came to Ephesus: and finding certain disciples, He said unto them, Have ye received the Holy Ghost since ye believed? And they said unto him, We have not so much as heard whether there be any Holy Ghost.\n\nAnd he said unto them, Unto what then were ye baptized? And they said, Unto John's baptism.\n\n Then said Paul, John verily baptized with the baptism of repentance, saying unto the people, that they should believe on Him which should come after him, that is, on Christ Jesus.”\n\n\nThe scriptures above revealed Apollos' limited knowledge about Christ before meeting Aquila and Priscilla. He had little or no knowledge of Christ as the Lord and personal Saviour of all mankind. Moreover, he had little or no knowledge about the Holy Spirit baptism. He spoke and quoted scriptures about Christ but had little practical knowledge of Him. This means Apollos didn't know Christ as his Lord and personal Saviour. Priscilla and Aquila recognized that Apollos could preach but still had deep ignorance in him. From their view, they knew such inadequacy could make Apollos lead others astray from the true gospel of Christ. One key lesson to learn from this is that you may know how to preach to attract others’ attention, but you still need true mentorship in order to be effective in gospel work. We encourage you to get the messages, books and gospel materials of Holiness Revival Movement Worldwide to perfect your knowledge of Jesus Christ and His holy word and ways\n\nLuke 1 verse1 to 4\n\n“Forasmuch as many have taken in hand to set forth in order a declaration of those things which are most surely believed among us, Even as they delivered them unto us, which from the beginning were eyewitnesses, and ministers of the word;\nIt seemed good to me also, having had perfect understanding of all things from the very first, to write unto thee in order, most excellent Theophilus, That thou mightest know the certainty of those things, wherein thou hast been instructed.”\n\n\n3.2\tApollos' Humble Submission to Priscilla's Mentorship \n\n\nJames 4 verse 6\n\n“ But he giveth more grace. Wherefore he saith, God resisteth the proud, but giveth grace unto the humble.”\n\n First Peter 5 verse 5 and 6\n\n“Likewise, ye younger, submit yourselves unto the elder. Yea, all of you be subject one to another, and be clothed with humility: for God resisteth the proud, and giveth grace to the humble. \n\nHumble yourselves therefore under the mighty hand of God, that he may exalt you in due time:”\n\nIt requires humility to yield to true mentorship in the gospel work as did Apollos. One of the signs of spiritual bankruptcy today is the lack of humility in many Christians, which makes them rebuff mentorship in the gospel work. Many are not willing to learn from true ministers of the gospel. The reason for this may be because of age difference, denominational differences, ministerial seniority, doctrinal ignorance that denies submission to a woman in things of God.\n\nA story was told of a king who was very tough. He was so tough and pompous that his servants found it practically difficult to correct him on anything. One day, he was having a running stomach when going for a meeting with his servant. He had to use the toilet before going for the meeting. However, he did not know that after visiting the toilet part of his flowing regalia had patches of excreta on it. His servant noticed the mess as soon as he came out of the toilet, but he was afraid to inform the proud king. The king walked majestically into the hall of meeting unaware that he was accompanied by his excreta and its offensive look. It was a great public embarrassment when he was informed by the audience of the excreta on his dress.\n\nFrom this story we learn that pride and arrogance bring shame and disgrace. Therefore, be meek and humble and be willing to receive correction and reproof from others for your wisdom, excellence and perfection.\n\nMatthew 11 verse 28 to 30\n\n“Come unto Me, all ye that labour and are heavy laden, and I will give you rest. Take My yoke upon you, and learn of Me; for I am meek and lowly in heart: and ye shall find rest unto your souls. For My yoke is easy, and My burden is light.”\n\nIf you are proud, people will leave you with your mistakes to the detriment of your soul. Apollos was a humble man hence he benefited in many ways from the fruit of his humility. You may be a good servant of Jesus, but there may still be some ignorance in your life. You may be preaching very well but still have some errors polluting your message. Some of these preachers just need a second touch from Jesus in order to be effective preachers of the gospel. Apollos became an effective preacher after the mentorship of Priscilla and her husband.\n\n3.3.\tAge Is Not a Determining Factor in Mentorship \n\n\nGalatians 1 verse 15 to 16\n\n“But when it pleased God, who separated me from my mother's womb, and called me by His grace, To reveal His Son in me, that I might preach Him among the heathen; immediately I conferred not with flesh and blood:”\n\nEphesians 3 verse1 to 4, verse 7 and 8\n\n“For this cause I Paul, the prisoner of Jesus Christ for you Gentiles, If ye have heard of the dispensation of the grace of God which is given me to you-ward: How that by revelation He made known unto me the mystery; (as I wrote afore in few words, Whereby, when ye read, ye may understand my knowledge in the mystery of Christ) Whereof I was made a minister, according to the gift of the grace of God given unto me by the effectual working of His power.\n\n Unto me, who am less than the least of all saints, is this grace given, that I should preach among the Gentiles the unsearchable riches of Christ.”\n\nAquila and Priscilla were led by God to be mentored by Paul, the apostle, a man renowned for righteousness, holiness, the knowledge of God and revelations of Jesus Christ. Paul was a man of God, called to be a teacher of the gospel and endued with the gifts of the Holy Spirit.\n\nWhat a privilege it is to serve the Lord under such a man of God! Apostle Peter acknowledged the wisdom of Paul and humbled himself to read the writings of Apostle Paul which he called scriptures.\n\n Second Peter 3 verse15 to 16\n\n“And account that the longsuffering of our Lord is salvation; even as our beloved brother Paul also according to the wisdom given unto him hath written unto you;\n\n As also in all his epistles, speaking in them of these things; in which are some things hard to be understood, which they that are unlearned and unstable wrest, as they do also the other scriptures, unto their own destruction.”\n\n\nWe are not serving in a military barrack where we expect to be promoted according to the period of service. Paul said he was the least of all the apostles yet the Lord used him to do great exploits for Him. He wrote a lot of mysteries and truths that required prayers to be able to understand them. These show that age difference does not matter in the sight of God. God gave Paul the revelations of the gospel of Christ. Paul did great exploits for the Lord regardless of the fact that he came to know Christ after the other apostles.\n\n\n3.4 You May Need a Second Touch Through Mentorship\n\nSecond Corinthians 12 verse 7\n“And lest I should be exalted above measure through the abundance of the revelations, there was given to me a thorn in the flesh, the messenger of Satan to buffet me, lest I should be exalted above measure.”\n\nI admonish you to obey the teachings of Holiness Revival Movement, full of truth, power, wisdom and holiness. It is God's ministry for this end time. Do the assignments given to you by this ministry. Do not busy yourself with things of this world to the hurt of your soul. Stop your unworthy excuses and listen to the inspired messages of this ministry. The messages are made available to you through DVDs, CDs, books, magazines, tracts and other materials. These messages are part of the mentorship God desires you to receive in Holiness Revival Movement Worldwide (HEROMOW). They are also available on YouTube. God is using them to prepare you as a vessel of honour. Do not listen to Satan inspired enemies of Holiness Movement who publish lies and evil report against this Movement and her leadership to hinder the salvation of human souls.\n\nPriscilla received a second touch from the Lord after being mentored by Paul. There are many “Priscillas” that need to be trained and made to receive a second touch from the Lord. By the same token, there are many “Apollos ministers” who are in wrong marriages, living immoral lives, and ignorant of gospel truth. Such “Apollos ministers” are operating in deep errors and therefore need a second touch from the Lord. Examine yourself if you are in this category of “Apollos ministers” and yield to true mentorship in Christ. Identify with Holiness Movement for proper gospel training in truth, righteousness and holiness for end time exploits.\n\nColossians 2 verse 6 to 7\n“ As ye have therefore received Christ Jesus the Lord, so walk ye in him:\n\n Rooted and built up in him, and stablished in the faith, as ye have been taught, abounding therein with thanksgiving.”\n\nTrue mentorship is possible through submission to God's true ministers. It is a blessing, if you have a righteous husband who is a minister of the true gospel. Submit to him. Go with him to change the world. Help the denominational churches to know the true gospel of our Lord Jesus Christ. Priscilla served the Lord to the end.\n\nWork along with me, Pastor Paul Rika, to promote the Lord Jesus Christ and biblical truth, righteousness, and holiness. Join your husband in HOREMOW to work with me and be the Priscilla of our days in this end time. Make friends with the weak in Christ. Mentor and help them out of ignorance. Go and tell them that Jesus Christ is the Lord. Improve the ministry of Pastors, Evangelists, Prophets, and teachers, as Priscilla did on Apollos. Be significant in the Christian life and ministry!\n\nCHAPTER FOUR\n\nGOD CAN USE A WOMAN TO TEACH, PREACH AND PROPHESY\n\nThere was a woman in Israel who brought revival to the nation, recovered them from backsliding and delivered them from the hand of their enemies. Her name was Deborah.\n\nJudges 4 verse 1 to 5\n\n“And the children of Israel again did evil in the sight of the LORD, when Ehud was dead. \n\nAnd the LORD sold them into the hand of Jabin king of Canaan, that reigned in Hazor; the captain of whose host was Sisera, which dwelt in Harosheth of the Gentiles. \n\nAnd the children of Israel cried unto the LORD: for he had nine hundred chariots of iron; and twenty years he mightily oppressed the children of Israel. \n\nAnd Deborah, a prophetess, the wife of Lapidoth, she judged Israel at that time. \n\nAnd she dwelt under the palm tree of Deborah between Ramah and Bethel in mount Ephraim: and the children of Israel came up to her for judgment”\n\n4.1. Sin Gives The Enemy The Upper Hand\n\nIt was very common that Israel would go into sin and idolatry before the Lord and lose His presence and relationship. This happened over and over again. Whenever it happened, the Lord would allow their enemies to punish or oppress them and when they cried unto the Lord, He would send them a national leader called a judge, to deliver them. On this occasion, when they sinned again against Him, He sold them to Jabin, the king of Canaan who cruelly oppressed them for twenty years. The lesson to learn from this vicious cycle of oppression of Israel is that sin strengthens the hands of the enemy against the sinful person.\n\nProverbs 26 verse 2\n\n“As the bird by wandering, as the swallow by flying, so the curse causeless shall not come.”\n\n\nCheck yourself when you begin to see some hard things coming your way. It could be that you have left the Lord and the Lord has allowed Satan to take over and oppress you. It was like that with the children of Israel. When they left the Lord, the Lord would allow them to dance\ninto the hand of their enemies, until they repented and cried unto Him. Then He would send them a leader, someone that would redeem them from their situation. If that be the case with you, you know the reason why you are passing through frustration, you know why the hand of the Lord is heavy upon your life, then you need to repent. Stop that sin, turn back to the Lord and cry to Him to give you His salvation.\n\nIsaiah 55 verse 6 to 7\n\n“Seek ye the LORD while He may be found, call ye upon Him while he is near: Let the wicked forsake his way, and the unrighteous man his thoughts: and let him return unto the LORD, and He will have mercy upon him; and to our God, for He will abundantly pardon”.\n\n4.2\tGod Can Use a Man or Woman\n\nJabin the king of Canaan oppressed Israel for twenty years. When they cried to the Lord, He gave them Deborah to deliver them. It looked out of order that the children of Israel should be led by a woman. If you look at the way the writer wrote it, his expression was with emphasis. He wanted people to know that the leader was indeed a woman. In verse 4 it says, “And Deborah;” that is a feminine word. “A prophetess,” another feminine word. Still talking about Deborah, “the wife of Lapidoth;” yet another feminine word. “She judged Israel at that time;” the fourth feminine description. All to emphasize the feminine character of the person being talked about. Do you really know how it happened that the Israelites came to the point that a woman, Deborah, became their judge? God wanted to show His sovereignty over His human creature?. He can use whom He wills. God did this to humble man in his pride and disdain over the woman. God is saying, I use whomever I will.\n\nRomans 9 verse 15\n“For he saith to Moses, I will have mercy on whom I will have mercy, and I will have compassion on whom I will have compassion.”\n\n\nDo not think I God follow stereotyped formulas? You may see me following formulas some times, but if you follow formulas continuously, you may not find me there.\n\nJohn 3 verse 8\n\n“The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.”\n\nGod raised Deborah up at this time to lead the nation Israel as a prophetess and judge. A woman taking the lead over men was not out of place for God up to this day. Let men make provision for their wives in divine call to service. God can choose you woman to do special service for Him. Let not your husband say,' Why not him instead? As a sovereign Being, God does not have an adviser or instructor. Make provision, oh church, for women ministry; for God can choose to use them. God can choose to use a woman in any aspect of church work according to His wisdom. Let not the Church say, “Ah! It is out of order for the woman to be a pastor.” Out of order? Well, do you want God to follow your order or His word? Although God sets order, yes, but His orders are known to Him. He can make a woman the pastor over a church. You mean Deborah, the wife of Lapidoth, was not a pastor over Israel? Many misinterpret portions of scriptures to confuse their followers. You must compare scriptures with scriptures to understand God's truth\n\nJeremiah 3 verse15\n\n“And I will give you pastors according to mine heart, which shall feed you with knowledge and understanding.”\n\nJudges 4 verse 4 and 5\n\n“And Deborah, a prophetess, the wife of Lapidoth, she judged Israel at that time.\n\nAnd she dwelt under the palm tree of Deborah between Ramah and Bethel in mount Ephraim: and the children of Israel came up to her for judgment.”\n\nThat is the sovereignty of God. In case you say, “No! I will not listen to her; I will not listen to a woman.” The Bible says,\n\nMatthew 10 verse 40\n\n“He that receiveth you receiveth Me, and he that receiveth me receiveth him that sent Me.” So learn humility. O man, learn it!\n\n4.3.\tA Woman Prophesying Involves Speaking to Men \n\n\nFirst Corinthians 11 verse 5 and 13\n\n But every woman that prayeth or prophesieth with her head uncovered dishonoureth her head: for that is even all one as if she were shaven.\n\n Judge in yourselves: is it comely that a woman pray unto God uncovered?\n\nA woman can be chosen to teach on any subject. Some Pharisees may object this saying, “It will never be, it is out of order. In fact the Bible says in\n\n First Timothy. 2 verse11 to12\n\n“Let the woman learn in silence with all subjection. But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence.”\n\nYou are even quoting scriptures, just to put these women out of ministry. The Lord will ask you to go back to the scriptures and then compare scriptures with scriptures. “Did I God say a woman can prophecy in the church? If so, by saying a woman should be in silence does it mean she should not prophesy? Am I not the one that said when she is prophesying she should cover her head? If so, why are you taking My word out of context, saying the Lord has instructed that she should be silent? Didn't you compare scriptures with scriptures? Is prophesying a silent business? Do you prophesy in your heart? Will people hear you? No! Again, did I not tell you that Philip the evangelist had four daughters that prophesied? By the way, what is prophecy? When I say the woman should prophesy, is it not according to My plan?”\n\nJoel 2 verse 28\n\n“And it shall come to pass in the last days, saith God, I will pour out My Spirit upon all flesh: and your sons and your daughters shall prophesy----.”\n\nWhat do I mean by that? 1Corinthians14 verse 3 says, 'But he that prophesieth speaketh…' He that prophesies does what? Speaks! But you are saying she should be silent. That is why you must learn how to interpret scriptures. Yes! For the letter killeth, but the spirit giveth life,2 Corinthians. 3 verse 6. “Would I God tell her to prophesy and then ban her from speaking completely? I will not do that.”\n\nIsaiah 66 verse 9\n\n“Shall I bring to the birth, and not cause to bring forth? saith the LORD: shall I cause to bring forth, and shut the womb? saith thy God.”\n\n\nThat is God asking you a question. “He that prophesies speaks unto men.” First Corinthians 14 verse 3. Then, why are you saying she should not speak to men?\n\nGod says, he that has a word of prophecy should speak unto men. 'Men' is a generic word here. Mariam was a prophetess; she spoke to men as well as to the women. Deborah, the prophetess, spoke to men as well as to women. So also the daughters of God should speak to women and to men as well. And what should they say to men?\n\nBut he that prophesieth speaketh unto men to edification, and exhortation, and comfort.1Corinthians. 14 verse 3. The Bible tells us the word of God is the sure word of prophecy.\n\n Second Peter 1verse 19 to 21\n\n“We have also a more sure word of prophecy; whereunto ye do well that ye take heed, as unto a light that shineth in a dark\nplace, until the day dawn, and the day star arise in your hearts:\n\n Knowing this first, that no prophecy of the scripture is of any private interpretation.\n\n For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost.”\n\nYou know quite well that the prophecies of old time recorded in the scripture were given by both men and women. The same thing is true of the prophecies of the New Testament. Therefore, the woman has the right to speak the word of God to men for edification, exhortation and comfort in the church. She has the right to speak the word of God in the church to edify people in the church, to exhort people in the church, which is a mixed congregation of men and women. Because she has been given the word, she has received the sure word of prophecy, she has received inspiration, she has received the calling, she must speak the word to the audience, that the church may obey the Lord.\n\nActs 26 verse16 to18\n\n“But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee;\nDelivering thee from the people, and from the Gentiles, unto whom now I send thee, To open their eyes, and to turn them from darkness to light, and from the power of Satan unto God, that they may receive forgiveness of sins, and inheritance among them which are sanctified by faith that is in Me.”\n\n\n4.4. The Woman Can Both Preach and Teach\n\nSome say the Bible says a woman can preach but not teach. They do not have the correct understanding of the scripture below\n\nSecond Timothy 2 verse 12\n\n“But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence.”\n\nFirst, let me draw attention to the fact that this scripture is written in a general sense and not applicable to any specific occasion. Otherwise it will mean that the woman cannot stand before any group of people in the church or human society at any time to teach them. Now let us compare scriptures with scriptures. What does the scripture mean when it says in Titus 2 verse 3 and 4?\n\n“The aged women likewise, that they be in behaviour as becometh holiness, not false accusers, not given to much wine, teachers of good things…”\n\nThe Bible says that they should teach good things. “That they may teach the young women to be sober, to love their husbands, to love their children.” Can you see now? Does “I suffer not a woman to teach nor usurp authority over the man” mean “Leave all teachings to men?” No! The Bible did not say so. Here, the Bible has given her the license to teach “good things.” Salvation is a good thing, heaven is a good thing, and the message of the gospel is a good thing. She should teach others that they may learn good character!\n\n\n4.5.\tWomen Must Not Usurp Authority Over Men \n\n\nLook back on those scriptures; you will see some traces that caused such instructions to be given.\n\nFirst Corinthians 14 verse 33 to 35\n\n“For God is not the author of confusion, but of peace, as in all churches of the saints.\n\n Let your women keep silence in the churches: for it is not permitted unto them to speak; but they are commanded to be under obedience, as also saith the law.\n\nAnd if they will learn anything, let them ask their husbands at home: for it is a shame for women to speak in the church.”\n\nIf you take this literally, you will stop all women from prophesying because you will say, “It is a shame for women to speak in the church.”\n\nYou will stop all their activities. Even the songs that they are singing in the church will be a shame. When women sing in the Church, do you really see it as shame to them? We should learn how to interpreted the scripture. When women give testimonies in the church of the grace and goodness of the Lord in their lives, do these bring shame to them or to the church?\n\nNow, if you look at this scripture you will see that some women were bringing confusion to the church which explains why the apostle said,\n\n“God is not the author of confusion”. Again the Scripture says that, “They are not permitted to speak, but they are commanded to be under obedience. “Some women were disobedient in the church; that was why the law came to control such disobedient ones. And the Scripture also says in\n\n\nFirst Corinthians 14 verse 35,\n\n“If they will ask anything, let them ask their husband at home, for it is a shame for women to speak in the church.” It means these disobedient women are causing shame in the church. No righteous woman will cause shame in the church. No holy woman will cause shame in the church. It is the unruly and disobedient women that cause shame, and in that case, they must be controlled. The leaders are to limit their liberty in the church to ensure the peace of the church. God is the author of peace.\n\nAlso, some women were exercising carnal authority over their husbands and other men. They were carnal, not God-led or God-inspired. By their use of carnal authority over the men, they highjacked power from them. That was why Paul said that such women should be controlled because they are bringing confusion to the church.\n\n First Timothy 2 verse12 to 14\n\n“But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve. And Adam was not deceived, but the woman being deceived was in the transgression.”\n\nCan you see that? I suffer not a woman to teach nor to usurp(or highjack authority or power from men). The action “teach” above is not something done in righteousness and by divine inspiration, but something done forcefully and wrongfully in carnality. It shows that she is using carnal authority and false zeal to highjack control from the men. She is forward; and is using her natural property as a woman to forcefully lead the men. That is dangerous! For Adam was not in the transgression. It was the forwardness of Eve that gave chance to Satan to bring collapse to their\nrelationship with God in the garden of Eden.\n\nConsequently, if you allow a woman to employ her carnal emotions and feminine powers to take the lead over men, the church system will collapse. Therefore, such carnal ones must be kept silent and put under subjection. Adam was first formed, so why is she usurping authority over the man? As we can see, it is the unholy women that caused these commandments to come up, not the holy women, not the righteous women, not the women led by the Spirit of God. Hence, this rule does not apply where the woman concerned is born again and is holy, being called by God and inspired by the Holy Spirit in Christian service as Deborah was.\n\n First Timothy 1 verse 9 to 11\n\n“Knowing this, that the law is not made for a righteous man, but for the lawless and disobedient, for the ungodly and for sinners, for unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, \n\n\nFor whoremongers, for them that defile themselves with mankind, for men stealers, for liars, for perjured persons, and if there be any other thing that is contrary to sound doctrine;\n\n According to the glorious gospel of the blessed God, which was committed to my trust.”\n\n\nTherefore, the law made in the church against women is not for the righteous and holy, but to control the disobedient and the ungodly ones among them. The scriptures open a full door of service to the woman. She is a helpmate for man in the secular world, in the family circle, in the church and also in spiritual matters. The Lord has made her a helper to assist the man in the activities he is doing, so that the work can be done well and very quickly. So she has a good role to play in the church and in Christian ministry.\n\nNow woman, God has put off the obstacles which have limited you in the Lord. Satan knows about the soon-coming of Christ and wants to deprive the Lord of His labourers. He did this through tradition of men and mis-interpretation of scriptures. Now that the truth has been revealed, let the woman go full blast in her service to the Lord, according to her divine calling without any limitations.\n\nColossians 2 verse 8 and 10\n\n “Beware lest any man spoil you through philosophy and vain deceit, after the tradition of men, after the rudiments of the world, and not after Christ. And ye are complete in him, which is the head of all principality and power:”\n\n\n4.6. A Door of Service Is Fully Opened for Women\n\nI have loved thee Revelation 3 verse 7 to 9\n\n“And to the angel of the church in Philadelphia write; These things saith He that is holy, He that is true, He that hath the key of David, He that openeth, and no man shutteth; and shutteth, and no man openeth;\n\n\n I know thy works: behold, I have set before thee an open door, and no man can shut it: for thou hast a little strength, and hast kept My word, and hast not denied My name. Behold, I will make them of the synagogue of Satan, which say they are Jews, and are not, but do lie; behold, I will make them to come and worship before thy feet, and to know that.”\n\nGod's ways are not man's ways; God's thoughts are not man's thoughts. Deborah, the wife of Lapidoth, was the leader of Israel at that time. Deborah the wife of Lapidoth brought revival to Israel at that time. She also judged Israel in matters of righteousness at that time. Hallelujah! That is what God wants us all to know. He is the sovereign God. Both married and single Christian women should accept divine call and go for end-time exploits for Jesus Christ.\n\n4.7.\tLet The Women Behave Righteously to Their Husbands \n\nYou will notice in scripture that Deborah had no crisis with her husband. She did not have marital or family problem. This is because she discharged her marital obligations to her husband faithfully. She loved him, submitted to him and reverenced him. Her husband was not neglected or despised because of her ministry.\n\nTitus 2 verse 3 to 5\n\n“The aged women likewise, that they be in behaviour as becometh holiness, not false\naccusers, not given to much wine, teachers of good things; That they may teach the young women to be sober, to love their husbands, to love their children, To be discreet, chaste, keepers at home, good, obedient to their own husbands, that the word of God be not blasphemed.”\n\nChristian woman, to prosper in your ministry and to qualify for reward from the Lord requires holiness of life and character, which shows up in good behavior towards your husband. The most important thing in your life is not anointed Christian service, but holy Christian character. Therefore, treat your husband and household well.\n\n First Peter 3 verse 1 to 6\n\n“Likewise, ye wives, be in subjection to your own husbands; that, if any obey not the word, they also may without the word be won by the conversation of the wives; While they behold your chaste conversation coupled with fear.\n\nWhose adorning let it not be that outward adorning of plaiting the hair, and of wearing of gold, or of putting on of apparel; But let it be the hidden man of the heart, in that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price. For after this manner in the old time the holy women also, who trusted in God, adorned themselves, being in subjection unto their own husbands:\n\nEven as Sara obeyed Abraham, calling him lord: whose daughters ye are, as long as ye do well, and are not afraid with any amazement”.\n\n\nRemember to obey God and exalt Him above your husband in matters of your Christian life and ministry. Be ready to suffer under an unbelieving and difficult husband who is resisting your Christian life and commitment to the ministry. Do not mind being cast out of the marriage because of Jesus and His work.\n\n\nFirst Peter 4 verse 12 to16\n\n“Beloved, think it not strange concerning the fiery trial which is to try you, as though some strange thing happened unto you:  But rejoice, inasmuch as ye are partakers of Christ's sufferings; that, when his glory shall be revealed, ye may be glad also with exceeding joy. If ye be reproached for the name of Christ, happy are ye; for the spirit of glory and of God resteth upon you: on their part He is evil spoken of, but on your part He is glorified.\nBut let none of you suffer as a murderer, or as a thief, or as an evildoer, or as a busybody in other men's matters. Yet if any man suffer as a Christian, let him not be ashamed; but let him glorify God on this behalf.”\n\n\nMatthew 10verse 33 to 39\n\n“ But whosoever shall deny Me before men, him will I also deny before My Father which is in heaven. Think not that I am come to send peace on earth: I came not to send peace, but a sword.\nFor I am come to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.\n\n And a man's foes shall be they of his own household. He that loveth father or mother more than Me is not worthy of Me: and he that loveth son or daughter more than Me is not worthy of Me. And he that taketh not his cross, and followeth after Me, is not worthy of Me.\n\n He that findeth his life shall lose it: and he that loseth his life for My sake shall find it.”\n\n\nBe humble and obedient, be bold, courageous and wise. Do you allow your husband or marriage to destroy your soul.\n\nThe submission of your husband to God is required for your full submission to him. To submit to his ungodly rule is to exalt him above God and make him your idol!\n\nJames 1verse 2 to 8\n\n “My brethren, count it all joy when ye fall into divers temptations;\n Knowing this, that the trying of your faith worketh patience.\n\nBut let patience have her perfect work, that ye may be perfect and entire, wanting nothing.  If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.\n But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed.\n\nFor let not that man think that he shall receive any thing of the Lord.\n\nA double minded man is unstable in all his ways.”\n\nCHAPTER FIVE\n\nDEBORAH WAS A COURAGEOUS WOMAN AND HANDY VESSEL IN THE HANDS OF GOD\n\nAnother reason why Deborah came handy for divine assignment was because no man was courageous enough to take the lead to deliver the people from the hands of their oppressors. The hearts of all the men melted before their enemies. This made God to turn to a woman for the revival of His people.\n\nJudges 5 verse 1 to 2 ,6 to 7\n\n“Then sang Deborah and Barak the son of Abinoam on that day, saying,\n\nIn the days of Shamgar the son of Anath, in the days of Jael, the highways were unoccupied, and the travellers walked through byways.\n\n The inhabitants of the villages ceased, they ceased in Israel, until that I Deborah arose, that I arose a mother in Israel.”\n\n“Until that I Deborah arose.”Was she proud? No, she was not proud. She was revealing to us that God can use women for His work, even as He uses men. Hence women should be prepared for God's service in any capacity according to His will and calling, even though the Bible recognizes them as weaker vessels.\n\n\n5.1\tWomen Are Not Weak in The Hands of God \n\n First Peter 3 verse 7\n\n“Likewise, ye husbands, dwell with them according to knowledge, giving honour unto the wife, as unto the weaker vessel, and as being heirs together of the grace of life; that your prayers be not hindered.”\n\nPeople are taking this phrase 'As unto the weaker vessel' too far. They are using this statement to despise the women. They are making it to look like women cannot preach, cannot pastor, cannot minister to the spiritual needs of brethren in the church. But God in His wisdom contradicts such masculine biases and chose to use Deborah in her time to take the lead over men!\n\nFirst Corinthians.1 verse 27 to 31\n\n“But God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty;\nAnd base things of the world, and things which are despised, hath God chosen, yea, and things which are not, to bring to nought things that are: That no flesh should glory in His presence.\nBut of Him are ye in Christ Jesus, who of God is made unto us wisdom, and righteousness, and sanctification, and redemption:\n\n That, according as it is written, He that glorieth, let him glory in the Lord.”\n\n\n5.2 God Can Use a Weak Vessel to Confound the Strong\n\n\nImagine what Deborah achieved in her time when the men were afraid, when the men ran away, and when the men were asleep! Is our time not similar to Deborah's time? When you look at the churches today, do you not see the era of Deborah playing out again? Are you not seeing Deborah's time replicated in our time? When you look at the society, what do you see? Are you not seeing the same problem? When you enter the church on worship day, look round and see the ratio of men to women. Is that not a proof that the days of Deborah are here? Is that not a proof that the men are afraid, that the men are away from God, that the men are asleep in sin? It is when people go to sleep that the enemies do their work.\n\nMatthew 13 verse 25 to 27\n\n“But when the blade was sprung up, and brought forth fruit, then appeared the tares also. So the servants of the householder came and said unto him, Sir, didst not thou sow good seed in thy field? from whence then hath it tares? \n\nWhen men fall asleep, the enemies go to do evil. So God is now saying, By the way, is it only men I created? I created women also and if the men have become afraid, I will raise up the women.”\n\nDid He not say in Luke 19 verse 40, “I tell you that, if these should hold their peace, the stones would immediately cry out?”\n\nEven stones! Woman, transformation is coming into your life! The God of heaven will raise you up for His name and people shall hear your revival story.\n\nWhen the Lord told Moses to tell the people of Israel they would eat flesh, Moses replied:\n\nNumbers 11 verse 21 to 22\n\n“The people, among whom I am, are six hundred thousand footmen; and Thou hast said, I will give them flesh, that they may eat a whole month. Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?  And the LORD said unto Moses, Is the LORD'S hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.”\n\nLet nobody doubt what God will use women to do in this end time by the Holy Ghost. God, the creator of the women, is the one talking. God's call on women is what I am bringing to your knowledge. I am telling the women to rise up to this calling of God because most men in the local churches have gone into captivity to sin and Satan.\n\n\n5.3. Many Churches No More Bother About Heaven Or Hell\n\nThere is no more fear of God in many churches. In some local churches, the pastors and church elders engage themselves in physical combat. Have you witnessed or heard of that before? The abomination has gone far; no fear of God in the churches. They do not believe in Jesus any more. The preachers themselves are unbelievers. Bishops and pastors concoct plans together to kill a messenger Jesus sends with the message of righteousness, holiness and truth.\n\nLuke 12 verse15 to 21\n\n“And He said unto them, Take heed, and beware of covetousness: for a man's life consisteth not in the abundance of the things which he possesseth. And He spake a parable unto them, saying, The ground of a certain rich man brought forth plentifully: And he thought within himself, saying, What shall I do, because I have no room where to bestow my fruits?\n\n And he said, This will I do: I will pull down my barns, and build greater; and there will I bestow all my fruits and my goods. And I will say to my soul, Soul, thou hast much goods laid up for many years; take thine ease, eat, drink, and be merry. But God said unto him, Thou fool, this night thy soul shall be required of thee: then whose shall those things be, which thou hast provided? So is he that layeth up treasure for himself, and is not rich toward God.”\n\nHeaven is no more the priority of most churches. I heard that a particular Bishop invited people to fantastic mansion he built which was described as “heaven on earth.” As he showed them round he said, “This is why I don't think of going to heaven now. How can I have all these things and be thinking of going to heaven now?” Exactly! They are not thinking of going to heaven. They have enough wealth that Satan has given them. Satan has told them, “All these things will I give thee, if thou wilt fall down and worship me.”(Matthew 4 verse 9).\n\nThey have “arrived,” so they are not thinking of heaven anymore.\n\nAlso, they are not conscious of the possibility of going to hell either. This is the situation of many church leaders, pastors and members. If you go and tell them, “This thing will take you to hell fire. Stop it.” They will laugh and tell you “Who are you to judge another man's servant? Bible says, 'Judge not!'” I was told of one of the brothers in Holiness Movement some years ago who attends one of these prosperity churches. He took the message of hell fire to the little children and taught them on the eternal consequences of sin. He warned them against sinful behaviours, which would take them to hell. The children began to ask, “Uncle, hell fire? Where is it?” This is because they were worshiping in a church where hell fire was never preached or taught.\n\nA man who attends that church called me and said, “For eleven years that I have been in this church, I have never heard any message on the return of Jesus. No! I have never heard it preached in the church. It was one guest preacher from somewhere that told us Jesus is coming back soon. “That is the situation of many churches. They are completely lost! They are not aware of hell and are not bothered about it. In fact, it is not in their heart to preach or live by the true word of God. What they preach is human science and philosophy. How to get rich, and how to live in peace, and make progress. They use enticing words of man's wisdom.\n\nColossians 2 verse 8\n\nBeware lest any man spoil you through philosophy and vain deceit, after the tradition of men, after the rudiments of the world, and not after Christ.\n\nThey are preaching about generation curse, going to people's houses to deliver them from generation curse; showing that their belief in Jesus is not enough. They say, “Your great grandfather, who died 100 years ago, had a contract with Satan and in fact if you do not go for this generation curse deliverance…., in fact, it is the reason why you are not married. “They corrupt believers through preaching the “gospel according to money.” They make people pay a lot for deliverance prayer and for everything they desire from God.\n\nFirst Timothy 6 verse 7 to11\n\n7 For we brought nothing into this world, and it is certain we can carry nothing out.\n\n8 And having food and raiment let us be therewith content.\n\n9 But they that will be rich fall into temptation and a snare, and into many foolish and hurtful lusts, which drown men in destruction and perdition.\n\n10 For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\n\n11 But thou, O man of God, flee these things; and follow after righteousness, godliness, faith, love, patience, meekness.\n\n\n5.4\tHypocrisy and Deceit in the Church\n\nHow many churches are free from hypocrisy and deceit? Things are buried in their altar to manipulate members. It reminds me of the story of a man I heard lives in South Africa. He wired a corner of his sitting room with concealed open electric cable that gives mild electric shock to anyone that comes around the place. Anytime people come to him to be baptized in the Holy Ghost, he invite's them to his house for special prayers and tell's them, “It is a simple thing to receive Holy Ghost Baptism. Just move to that corner and begin to pray for Holy Ghost baptism.” While the prayer is on, he goes inside and switches on the power of the concealed wire and as soon as they begin to experience mild electric shocks he says, “Yes, that is the Holy Ghost?. Speak any illegible words. That is the Holy Ghost baptism.”\n\nHoly Ghost? I am telling you, this people have gone far. That is why you see sinners speaking in “tongues” now. They don't know Jesus and yet they are speaking in tongues. Righteousness is not in their church, yet they are speaking in tongues. Where did they get it from? “Holy Ghost” electricity! That is what is going on now. Satanism and witchcraft have taken over. Youths and children are in great danger of witchcraft initiation in the church!\n\nActs 8 verse 9 to 11\n\n9 But there was a certain man, called Simon, which beforetime in the same city used sorcery, and bewitched the people of Samaria, giving out that himself was some great one:\n10 To whom they all gave heed, from the least to the greatest, saying, This man is the great power of God.\n\n11 And to him they had regard, because that of long time he had bewitched them with sorceries.\n\nGod has given us more time to work and get things done very quickly. The few righteous ones are passing through great oppression and persecution. Husbands have been told to torture their believing wives to ensure all this holiness and righteousness does not continue. Infact, in one of the churches in Plateau State, Nigeria, during their holy communion service they announced, “All women that have removed their earrings should put them on, otherwise, they will not partake in this holy communion. “What a practical battle against holiness!\n\nMany Pastors and Elders Do Not Know Jesus\n\nJeremiah 2 verse 8\n\n8 The priests said not, Where is the LORD? and they that handle the law knew Me not: the pastors also transgressed against Me, and the prophets prophesied by Baal, and walked after things that do not profit.\n\nThe pastors and elders do not know the Lord nor His ways. The power they are working with is satanic power, and they are evangelizing one another, taking themselves to the beach to meet mermaid spirits. The more converts a pastor takes to Satan to receive demonic power, the greater he becomes in Satanism.\n\nThe Lord gave a revelation of one of these great churches. The church is divided into two during service. One side of the building is dedicated to the worship of God while occultism goes on at the other side. The building has underground apartment. The pastor shuttles from one side to the other leading activities!\n\nMatthew 15 verse 7 to 9\n\n“Ye hypocrites, well did Esaias prophesy of you, saying, This people draweth nigh unto Me with their mouth, and honoureth Me with their lips; but their heart is far from Me. But in vain they do worship Me, teaching for doctrines the commandments of me”.\n\nThe revelation showed one of the members saying, “You know what is happening is that, going to the witch doctor is a public thing and it is causing people shame. As a result, witch doctor business has now moved to the church. We come as worshippers in the church, but move to the occult side. Some in that same church are not aware.”\n\nSecond Timothy 2 verse 22\n“Flee also youthful lusts: but follow righteousness, faith, charity, peace, with them that call on the Lord out of a pure heart.”\n\nThat is what is going on in many of these churches. In that church, some are worshiping, thinking they are worshiping God. Can God be in that place? The Bible says, can Satan and Jesus be in the same temple?\n\n Second Corinthians 6 verse14 to18\n\n“Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? and what communion hath light with darkness?\n\n And what concord hath Christ with Belial? or what part hath he that believeth with an infidel? And what agreement hath the temple of God with idols? for ye are the temple of the living God; as God hath said, I will dwell in them, and walk in them; and I will be their God, and they shall be My people. Wherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing; and I will receive you, And will be a Father unto you, and ye shall be My sons and daughters, saith the Lord Almighty.”\n\nBut many of the churches are like sheep that have no shepherd. God is now calling on women, because the men are gone, they have been overtaken, they have become very few in His presence. Elijah thought he was the only prophet of God left, but the Lord told him there were 7000 more. But how many were 7000 in the whole nation of Israel? So that is the case now. The righteous in Christ are too few!\n\n\nCHAPTER SIX\nWOMAN! GOD WANTS TO USE YOU\n\nwoman, do not let the tradition of men hinder you. Accept God's call and arise for His work.\n\nExodus. 3 verse 2 to 10\n\n“And the angel of the LORD appeared unto him in a flame of fire out of the midst of a bush: and he looked, and, behold, the bush burned with fire, and the bush was not consumed. \nAnd Moses said, I will now turn aside, and see this great sight, why the bush is not burnt. And when the LORD saw that he turned aside to see, God called unto him out of the midst of the bush, and said, Moses, Moses. And he said, Here am I. And He said, Draw not nigh hither: put off thy shoes from off thy feet, for the place whereon thou standest is holy ground. Moreover He said, I am the God of thy father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face; for he was afraid to look upon God. And the LORD said, I have surely seen the affliction of My people which are in Egypt, and have heard their cry by reason of their taskmasters; for I know their sorrows;\n8 And I am come down to deliver them out of the hand of the Egyptians, and to bring them up out of that land unto a good land and a large, unto a land flowing with milk and honey; unto the place of the Canaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites.\nNow therefore, behold, the cry of the children of Israel is come unto Me: and I have also seen the oppression wherewith the Egyptians oppress them. Come now therefore, and I will send thee unto Pharaoh, that thou mayest bring forth My people the children of Israel out of Egypt.\n\nHere, God is addressing His faithful daughters saying, “You have heard and even seen it yourself; you know the oppression of the devil and his demons against My people. You know the hardship that Satan has put the people into and now they are crying to Me. They are sighing for salvation day and night. Come now My daughter, and I will send you to the gospel field to bring these people from sin and Satan unto eternal life in Christ.”\n\nIsaiah 6 verse8\n\n Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for Us? Then said I, Here am I; send me.”\n\n\n6.1\tDeceptive Worship in Some Churches\n\nSomebody told me the story of a youth who belonged to one of these evil churches. He was told by his pastor, “We are taking you to our headquarters in Abuja.” The boy journeyed to Abuja happily along with other people and came into the headquarters building. I told you earlier that, that kind of church is divided into two. The church had a section where people were kept for sacrifice. The boy found himself in that section. He did not know that he had been brought for sacrifice. Then a man of his own tribe, who was one of the hit men of the church noticed from the boy's accent that he was from his tribe. Because of that tribal connection, he felt compelled to save the boy. So he disclosed to the boy, “You are here to be sacrificed.” Alarmed, the boy exclaimed, “Eh!” The man repeated, “Yes, you are here to be sacrificed.” Meanwhile, worship was going on at one side of the building and sacrifice at the other side. Can a spring of water bring out sweet water and bitter water at the same time?\n\nJames 3 verse11\n\n11 Doth a fountain send forth at the same place sweet water and bitter?\n\nParadoxically, that is what is going on in many churches now. There is a camouflage hiding many terrible things going on underneath. So the man showed the boy the way of escape.\n\nI have seen the affliction of My people that are in Egypt and I know their sorrows. That is God talking to His daughters. “I have seen the affliction of your brethren and I know how their tax-master pastors are oppressing them. Therefore, I have come down to deliver them; I have heard their cry, their groaning.”\n\nWhen a cow is being slaughtered, do you know how it groans? How much more when a human being is being slaughtered and offered to Satan as sacrifice to make the church progress! I have seen the groaning of My people! Come now therefore, I will send you to Pharaoh and ye shall bring forth My people from Egypt. That is what the Lord is telling you, woman.\n\n\n6.2.\tGod Gives Full Backing to Women in Ministry \n\nWhen God told Moses, “Come and I will send you to Pharaoh,” Moses response was, “Who am I, that I should go unto Pharaoh to bring forth the children of Israel out of Egypt?”\n\nSimilarly, God is now saying to women, “I have removed that tradition out of your way. The tradition that makes you say “Who am I? I am just a woman?” The Lord has removed that tradition. He has shown you Deborah as an example. He used Deborah when the men were afraid, when the men were away from Him, when the men were asleep. When Moses said, “Who am I” what was God's response?\n\nExodus 3 verse 11 to12\n\n“ And Moses said unto God, Who am I, that I should go unto Pharaoh, and that I should bring forth the children of Israel out of Egypt? And he said, Certainly I will be with thee; and this shall be a token unto thee, that I have sent thee: When thou hast brought forth the people out of Egypt, ye shall serve God upon this mountain.”\n\nYour ministry shall prosper. You will lead the people out. You will be surprised of the crowd you shall lead out and they will come and serve God in the mountain of HOLINESS. God says, I will be with you; I, your God, will bless your ministry. Amen.\n\nExodus 3 verse13 to17\n\n“And Moses said unto God, Behold, when I come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, What is His name? what shall I say unto them? And God said unto Moses, I AM THAT I AM: and He said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you.\n\n\nAnd God said moreover unto Moses, Thus shalt thou say unto the children of Israel, The LORD God of your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, hath sent me unto you: this is My name for ever, and this is My memorial unto all generations. Go, and gather the elders of Israel together, and say unto them, The LORD God of your fathers, the God of Abraham, of Isaac, and of Jacob, appeared unto me, saying, I have surely visited you, and seen that which is done to you in Egypt: And I have said, I will bring you up out of the affliction of Egypt unto the land of the Canaanites, and the Hittites, and the Amorites, and the Perizzites, and the Hivites, and the Jebusites, unto a land flowing with milk and honey.”\n\nDaughter of the Most-High God, the Lord is saying this to you, “Go and tell them, I the Lord Jesus, the Lord of the church, have come for end time revival. I have seen how My people have been deceived, and locked up under the powers of Bishops, Overseers, Superintendents; and the powers of Satan. I have seen how they have been caged in. I have seen how they are passing through all kinds of affliction and how they are suffering from hunger and thirst. Go and tell them that I have come to get them ready for heaven; to take them to a land flowing with milk and honey. I have come to give them eternal life.”\n\nJohn 14 verse 2\n\n“In my Father's house are many mansions: if it were not so, I would have told you. I go to prepare a place for you.”\n\n“I have come to give them mansions in heaven; to prepare them for the rapture that they may make it to heaven. Go and tell them this, and if they ask, 'Who is the authority behind you?' Say to them, 'I AM WHO I AM, the First and the Last, the Alpha and Omega, the Beginning and the End is the one backing you up, woman! He is the one sending you! He is the one that will be with you!”\n\n\nExodus 3 verse18\n\n“And they shall hearken to thy voice: and thou shalt come, thou and the elders of Israel, unto the king of Egypt, and ye shall say unto him, The LORD God of the Hebrews hath met with us: and now let us go, we beseech thee, three days' journey into the wilderness, that we may sacrifice to the Lord our God.”\n\n6.3\tThe Power of God Shall Rest On You\n\nGod is saying, “They will believe you. Do not say, ‘I am a common woman.' I will make them believe. I will make them bow to your gospel, and then you and them shall confront those 'Pharaohic forces. ‘You will confront them and say, ‘Let the people of God go free. ‘You will wrestle with them; you will wrestle with principalities and powers; you will wrestle with spiritual wickedness in high places; you will wrestle with the rulers of darkness of this world. The LORD, who is the great God, will be with you.”\n\nExodus 3 verse 19 to 20\n\nAnd I am sure that the king of Egypt will not let you go, no, not by a mighty hand. And I will stretch out My hand, and smite Egypt with all My wonders which I will do in the midst thereof: and after that he will let you go.\n\n\nWoman, divine power will follow you; signs and wonders will follow you!\n\nLuke 10 verse19\n\n“Behold, I give unto you power to tread on serpents and scorpions, and over all the power of the enemy: and nothing shall by any means hurt you.”\n\nGod is saying, I know that Satan and his demons will not allow you. However, I will stretch forth My arm of end time judgment over Satan; I will pour down end time powers over Satan and he will allow you go. Those men bound by him will come out of his hand in Jesus name; those women and children under his oppression will come out of his hand in the name of Jesus. That is what the Lord is saying to you, daughter of Christ.\n\n\n6.4\tGod promises you His presence\n\nDeuteronomy 31 verse 6\n\n“Be strong and of a good courage, fear not, nor be afraid of them: for the LORD thy God, He it is that doth go with thee; He will not fail thee, nor forsake thee.”\n\nGod is going to back you up; he is going to support you with signs and wonders, and this work shall be done. The Lord has promised to go with you and to give you sure success. He has promised to accompany you in ministry and perform His signs and wonders in your ministry. The Lord will convince the people; He is going to make them believe what you shall tell them. God will make Pharaoh to bow to your authority. You shall certainly lead the people out of sin and Satan's hand to the truth, righteousness and holiness of God. They shall worship in the beauty of His holiness. They shall possess the mansions of heaven, in Jesus name. Be courageous, bold and wise.\n\n\n6.5\tGod Has Much People to Save\n\n\nActs 18 verse 9 to10\n“ Then spake the Lord to Paul in the night by a vision, Be not afraid, but speak, and hold not thy peace: For I am with thee, and no man shall set on thee to hurt thee: for I have much people in this city.”\n\nThe Lord has much people in your nation, much people in your local church, much people in your denominational church to save. The Lord has much people in this end time to bring into His kingdom. Do not be afraid, go for it; nothing will happen to you. Do not fear the police man; do not fear the government; do not fear church authority; do not fear the Sanhedrin; do not fear the Pharisees, and do not fear any man. The God of heaven says, I will be with you. You will succeed in this work! That is what the Lord is saying. Therefore, be bold; I have much people to save, much people to deliver, much people to redeem.\n\nTake this commission seriously and pursue it to final execution. Do not allow custom and tradition of men against women to deter you from this call to worldwide revival. Deborah was a woman like you, yet she brought revival to her nation. She was a prophetess; Huldah was a prophetess as well and brought revival to the land of Israel. You too will bring revival to your land, to your nation, to your church and to your community and the world at large. Is it a hard thing? Is it a bad thing?\n\nMatthew 9 verse 36 to 38\n“But when He saw the multitudes, He was moved with compassion on them, because they fainted, and were scattered abroad, as sheep having no shepherd.\n\n Then saith He unto His disciples, The harvest truly is plenteous, but the labourers are few;\n\n Pray ye therefore the Lord of the harvest, that He will send forth labourers into His harvest.”\n\nThe Lord is sending labourers now. Hallelujah! They are women ministers, they are the Deborahs of our time, they are taking up the mantle. Come, we are waiting for you, the work is too heavy for us, true preachers are not many. We are too few, we are looking for you. The Lord has called you and given you this book for your encouragement.\n\nMark 16 verse15 to 17\n\n“And he said unto them, Go ye into all the world, and preach the gospel to every creature. \nHe that believeth and is baptized shall be saved; but he that believeth not shall be damned. \n\nAnd these signs shall follow them that believe; In My name shall they cast out devils; they shall speak with new tongues;” \n\nWhatever the trap of the enemy, it shall not succeed. The Lord shall go with you. He shall perform signs and wonders in your ministry. The dead shall rise, the blind shall see, the cripple shall rise up and walk, the barren shall give birth to children and the dumb shall speak. Receive power! Go and work for Jesus, go and save the people.\n\n\n\nGalatians 1 verse 15 to 16\n\n“But when it pleased God, who separated me from my mother's womb, and called me by His grace, To reveal His Son in me, that I might preach Him among the heathen ; immediately I conferred not with flesh and blood:”\n\n\n\nCHAPTER SEVEN\nTHE LORD IS ON HIS WAY COMING\n\nRevelation 22 verse 12 ,16 and 20\n\n“And, behold, I come quickly; and My reward is with Me, to give every man according as his work shall be. I Jesus have sent Mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star. He which testifieth these things saith, Surely I come quickly. Amen. Even so, come, Lord Jesus.”\n\n\n7.1  This  Generation  Will  Witness  the Coming of the Lord\n\nWe are in a crucial time in the history of the world. Something special to God's people and dreadful to sinners is about happening. Maranatha! The Lord is coming! Amen. This shall cease to be a saying that appears to have no meaning. It shall soon be a saying with great meaning; for it is certain that this generation will witness the coming of the Lord face-to-face. We shall not die; we are the generation that shall welcome Jesus in the rapture. And I give you, beloved, rapture greeting because I believe you are among those that shall see the Lord come and shall be transformed. Amen. What grace the Lord has given you, to lay His hand upon you, to take interest in you, to make you one among those He is coming to take up to heaven soon! The righteous ones in the world are praying for His coming. They are saying, “Lord, come quickly.” The saints that are in heaven are also sighing and asking, “Lord, how long will it be before our brethren shall come to join us here?”\n\nRevelation 6 verse 9\n\n“And when He had opened the fifth seal, I saw under the altar the souls of them that were slain for the word of God, and for the testimony which they held: And they cried with a loud voice, saying, how long, O Lord, holy and true, dost Thou not judge and avenge our blood on them that dwell on the earth?”\n\n\n“How long”? They are sighing. “When will you judge the Devil and end up everything?” And in verse 11, “And white robes were given unto every one of them; and it was said unto them, that they should rest yet for a little season, until their fellow servants also and their brethren, that should be killed as they were, should be fulfilled.”\n\nThere is a sighing in heaven. These scriptures, of course, shall be in the days of tribulation. But even now, our brethren that have gone up to heaven are sighing for us on earth, praying for us to come up to heaven and join them. The word of God confirms the events of our time, showing that they are events indicating the coming of the Lord, and that He will come very soon. Now that the events are being fulfilled rapidly in quick successions in our generation, surely, the Lord is appearing soon. We know by studying the fig tree that this is the time the Lord is coming for His people. The Holy Spirit through revelations and divine visitations has testified this to us. Our dreams and the sighing of our spirit confirm that our time is the rapture time. Now, there is a cloud of witnesses testifying everyday of the rapture. We praise God.\n\n\n7.2\tHoliness Revival Movement Worldwide Is Set Up for Rapture\n\nWe are preaching with the consciousness that our generation is the generation of Christ's return. I am preaching with the consciousness\nthat I shall not die, but be alive and go with Christ in the rapture. May be the dream the Lord gave me in 1995 will come to pass in this ministry. In the dream I was leading a group of people. I saw demons knelt down with their heads bowed down before us, as we sang triumphantly of the victory of Christ. Suddenly, the rapture took place and we flew up to meet the Lord in the air. This dream might be fulfilled in HOREMOW. Praise the Lord! You, who are not ready, get ready. This revival of truth, righteousness and holiness that you are seeing now shall fill the world. This little thing you are seeing, the little fire that has just been kindled, shall fill the whole world. The Lord Himself is going to do it.\n\nFirst Kings 18 verse 41 to 45\n\n“And Elijah said unto Ahab, Get thee up, eat and drink; for there is a sound of abundance of rain.\n\nSo Ahab went up to eat and to drink. And Elijah went up to the top of Carmel; and he cast himself down upon the earth, and put his face between his knees, And said to his servant, Go up now, look toward the sea. And he went up, and looked, and said, There is nothing. And he said, Go again seven times. And it came to pass at the seventh time, that he said, Behold, there ariseth a little cloud out of the sea, like a man's hand. And he said, Go up, say unto Ahab, Prepare thy chariot, and get thee down, that the rain stop thee not.\nAnd it came to pass in the mean while, that the heaven was black with clouds and wind, and there was a great rain. And Ahab rode, and went to Jezreel.”\n\nThe Lord is raising up revivalists to revive the churches to biblical truth, righteousness and holiness before the rapture. For this gospel of the kingdom shall be preached in the World, then the end will come.\n\nHebrews 12 verse14\n\n“Follow peace with all men, and holiness, without which no man shall see the Lord:”\n\nFirst John 1 verse 3 to 7\n\n“That which we have seen and heard declare we unto you, that ye also may have fellowship with us: and truly our fellowship is with the Father, and with His Son Jesus Christ. And these things write we unto you, that your joy may be full.\n\n This then is the message which we have heard of Him, and declare unto you, that God is light, and in Him is no darkness at all.\nIf we say that we have fellowship with Him, and walk in darkness, we lie, and do not the truth:\n\nBut if we walk in the light, as He is in the light, we have fellowship one with another, and the blood of Jesus Christ His Son cleanseth us from all sin.”\n\n\nSecond Timothy 2 verse 22\n\n “Flee also youthful lusts: but follow righteousness, faith, charity, peace, with them that call on the Lord out of a pure heart.”\n\n7.3 Women and the Challenges of the Last Days\n\n\nI thank God for opening a wide door of ministry to women. Woman, the Lord has called you to be part of end time Holiness Ministry. You are to rejoice that by the grace of God you have been called to Holiness Ministry as others. God is going to give us holy men and women and specially prepared Christian materials to train you and put fire in your life, to make you an effective end time revivalist. You must be grateful to the Most High. These are the days of revival. It is revival time for the whole world because the Lord is coming. But then, there is a challenge.\n\nLuke 18 verse 8\n\n“I tell you that He will avenge them speedily. Nevertheless when the Son of man cometh, shall He find faith on the earth?”\n\nThe Lord is coming so quickly, so suddenly, but the world is not informed. The world around you is not conscious that the Lord is coming. Your nation is not conscious; the people in your community are not conscious that the Lord is coming. The governments of the nations are not talking about it because they are not informed. It is not on their agenda that Jesus is coming. This is a terrible ignorance. Do not join them in this ignorance.\n\nMatthew 24 verse 36 to 39\n\n “But of that day and hour knoweth no man, no, not the angels of heaven, but My Father only.\n\n But as the days of Noe were, so shall also the coming of the Son of man be. For as in the days that were before the flood they were eating and drinking, marrying and giving in marriage, until the day that Noe entered into the ark,\nAnd knew not until the flood came, and took them all away; so shall also the coming of the Son of man be.”\n\nIn the days of Noah, when Noah was announcing and preaching that the world would be destroyed with water, the people did not bother. They were not even conscious of it. They were eating and drinking, celebrating marriages, doing many projects in the world. They were carefree about their lives, until suddenly, water began to pour down from the sky and spring up from the ground. It was then they became conscious. But the people that heeded the warning were in the ark already. Although the world lies in ignorance, you should be conscious and fully alert of the coming of Jesus. Make sure you remain in the ark. Righteousness and holiness should remain your portion in Jesus name.\n\nYour brothers and sisters are ignorant of these things; your mother is ignorant of these things; your father is ignorant of these things; your neighbour is ignorant of these things. This is a sad truth! But thank God, you are not ignorant. May be like Noah you are crying, shouting and preaching to them, but they do not appear to hear. The fact that they despise it does not mean it shall not happen. The Lord shall surely come in our time. Keep yourself pure. When Lot could not gain any body in Sodom, he gained himself. When Lot could not even recover his sons-in-law in Sodom, he was able to recover his family. Although the wife got lost later, he recovered himself and his two daughters. So while you are preaching and telling them this, and they harden their heart or are laughing at you in their foolishness, ensure you retain your righteousness and holiness.\nWe see the Lord's coming so near as at the door, but many of our loved ones and acquaintances are not yet in Christ. The situation is just like being in examination hall and everybody is with his or her own writing sheet in readiness for the exam, but here is a precious friend of yours that is not in the hall! The examiner is coming in already with the question papers to share. Alas, this friend of yours has not yet come in. You are wondering, what is happening? Where has she gone to? Why is she not here?\n\n\n7.4. The Challenge of Backslidden Churches\n\nThe Lord is coming; the Lord is already at the door but there is another challenge. It is the challenge of the backslidden church! What they are doing in those churches now have no bearing with the Lord, yet the Lord of the church is coming to take His people home. Where is your mother? In which church has she gotten lost? Where is your brother? Where did he get lost? Where are your children? Why is your husband delaying? Which church has distracted his attention at this crucial time that the Lord is already at the door?\n\nLuke 18 verse 7 and 8\n\n“And shall not God avenge His own elect, which cry day and night unto Him, though He bear long with them?\n\nI tell you that He will avenge them speedily. Nevertheless, when the Son of man cometh, shall He find faith on the earth?”\n\nLook at the Lord coming; look at Him already at the door! Where is the faith of the church in this generation? Shall He find righteousness in the Church? Shall He find holiness in the church?\n\nLord, this issue is painful to the heart of your children. Now, you are coming for the church you founded, about 2000 years ago and it is at this time that there is so much backsliding in our midst. It is at this time that there is corruption everywhere. The churches are into various activities that have no bearing with God. Will you find faith in the world? Not only just a city; the challenge is worldwide. From country to country, the church is backslidden; the church has turned off; the church is busy doing other things! What is going on in the name of worship has no bearing with the holy God. Why are these things so at this crucial time of your coming?\nIt is a big challenge. The true faith for righteousness, holiness and heaven is disappearing from the churches. The ministers have gone into error, heresies and covenant with Satan. The few godly ones are under heavy persecutions. The wicked ones are struggling, working hard to make sure they extinguish the fire of the few godly remnants. That is the state of the church. What a big challenge!\n\n\n\n\nCHAPTER EIGHT\nINCREASING TEMPO OF SATANIC ACTIVITIES ON EARTH\n\nSatan is more conscious of the shortness of time than many Christians. He understands the times more than many of us. Satan reads the handwriting and knows the time, so he is working very hard, round the clock. Satan has assigned agents over your life to ensure you do not make it to heaven. He raised people against this Holiness Movement to knock it down right from the beginning, but God did not allow him. He planned many strategies against the Movement and its leadership and since then he has not relented. He is still on the drawing board planning other strategies they are to employ to stop this work, but by God's grace they will continue to fail.\n\nEphesian 6 verse10 to 20\n\n“Finally, my brethren, be strong in the Lord, and in the power of his might. Put on the whole armour of God, that ye may be able to stand against the wiles of the devil. \nFor we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.\n\n Wherefore take unto you the whole armour of God, that ye may be able to withstand in the evil day, and having done all, to stand.\nStand therefore, having your loins girt about with truth, and having on the breastplate of righteousness; And your feet shod with the preparation of the gospel of peace; Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked. \nAnd take the helmet of salvation, and the sword of the Spirit, which is the word of God: \n\nPraying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints; \n\nAnd for me, that utterance may be given unto me, that I may open my mouth boldly, to make known the mystery of the gospel, For which I am an ambassador in bonds:\nthat therein I may speak boldly, as I ought to speak.”\n\nOur faith is in our God. That is why I told the brethren in Holiness Revival Movement not to boast in this matter. It is not a matter of pride, because it is not of man. It is not the name of a ministry that saves, but the grace of God in it; neither is it the kind of leader over the ministry. Don't say, we will make it because of the man God has given us in Holiness Revival Movement. Is it this small me you are boasting about? No it goes beyond that, it is God Himself that we all must trust!\n\nI once said that I see myself over Holiness Movement as the third captain of the fifty. The first captain and his fifty men were sent to arrest Elijah when he was on the mountain but it ended up a great disaster.\n\nSecond Kings 1 verse 9 and10\n\n“Then the king sent unto him a captain of fifty with his fifty. And he went up to him: and, behold, he sat on the top of an hill. And he spake unto him, Thou man of God, the king hath said, Come down. And Elijah answered and said to the captain of fifty, If I be a man of God, then let fire come down from heaven, and consume thee and thy fifty. And there came down fire from heaven, and consumed him and his fifty.”\n\n\nThe second captain also came with his fifty men but he did not learn his lesson. He too was proud. He thought the matter was in wearing uniform. He thought the matter was in the power of the king, a human being. He came to Elijah and issued his command.\n\n Second Kings 1 verse 11 and12\n\n“Again also he sent unto him another captain of fifty with his fifty. And he answered and said unto him, O man of God, thus hath the king said, Come down quickly. And Elijah answered and said unto them, If I be a man of God, let fire come down from heaven, and consume thee and thy fifty. And the fire of God came down from heaven, and consumed him and his fifty.” \n\nThe king kept on sending people because he was not the one to die. He sent the third captain and his fifty. The third captain was like myself, or rather, I am like him. He came with humility, nothing to be proud of in this life. Not the uniform he was wearing nor the powers on him as one the king had sent. He came with a different spirit, having learned from group 1 and group 2, who both perished. He adopted a different and humble approach.\n\n Second Kings 1 verse 13 to15\n\n“And he sent again a captain of the third fifty with his fifty. And the third captain of fifty went up, and came and fell on his knees before Elijah, and besought him, and said unto him, O man of God, I pray thee, let my life, and the life of these fifty thy servants, be precious in thy sight. \n\nBehold, there came fire down from heaven, and burnt up the two captains of the former fifties with their fifties: therefore let my life now be precious in thy sight. And the angel of the LORD said unto Elijah, Go down with him: be not afraid of him. And he arose, and went down with him unto the king.” \n\n\nCarefulness\n\nI am passing a different spirit into your life, the spirit of carefulness, the spirit of humility. I am putting a contrite spirit into your heart; the Lord will not ignore the contrite ones.\n\nIsaiah 57 verse 15\n“For thus saith the high and lofty One that inhabiteth eternity, whose name is Holy; I dwell in the high and holy place, with him also that is of a contrite and humble spirit, to revive the spirit of the humble, and to revive the heart of the contrite ones.”\n\n Receive humility in your life! That is the spirit of victory; it is the spirit that will take you up to heaven. We need this spirit because the church has backslidden round about us. Many holiness churches that boasted of  their holiness  are  now  serving  Satan;  they  have failed. We must operate in a different spirit. I always say, Lord save our lives. Whatever is the wisdom of the devil, whatever is the power of the devil, I the captain of the fifty and my fifty, shall never die. We shall make it in the rapture. There shall be no corruption, no decay in this Holiness Movement until we see you, Lord. With broken spirit, with contrite spirit, with humility, and with full obedience we shall serve you Lord. Satan has lost us forever! Amen.\n\nRevelation 12 verse 12\n\n“Therefore rejoice ye heavens, and ye that dwell in them. Woe to the inhabiters of the earth and of the sea! for the devil is come down unto you, having great wrath, because he knoweth that he hath but a short time.”\n\nIf you see the eyes of Satan now, it is burning red against Holiness Movement; it is burning red over the leaders and against you that has agreed with and has accepted the holiness message. Satan is boasting: Ah, who are you? I have pulled down many ministers; I have cast down and wounded great churches. I have put them in their corner, who are you? The Lord will answer the devil; He will describe us to the devil. He is in us. In the name of Jesus, the devil shall fall.\n\nMy confidence is this: Abraham made it to heaven, Sarah made it to heaven, Joseph made it to heaven, Moses made it to heaven, Paul made it to heaven, Peter made it to heaven, Mary made it to heaven, Timothy made it to heaven, we too will make it to heaven, God will take you there! If the devil had hindered all of them from making heaven, then we will have no hope. If it is just that human beings miss it because of pride, carelessness and the work of the flesh, we will say as the sparrow, “If the hunter devil is shooting without missing, we shall fly high without perching.” He will never get us. Make sure Satan never gets you. Sister, hold yourself well in Holiness Movement; God shall carry you on His wings and fly you to heaven. God will help you enter there. The holy life is a mystery to Satan. Before he understands what, we shall have left the earth to heaven. Praise the Lord!\n\n\nCHAPTER NINE\n\nTHE DIVINE PLAN TO OVERCOME ENDTIME CHALLENGES OF SATAN\nJeremiah 29 verse11\n\n“For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end.”\n\n\nEzra10 verse 2\n\n“And Shechaniah the son of Jehiel, one of the sons of Elam, answered and said unto Ezra, We have trespassed against our God, and have taken strange wives of the people of the land: yet now there is hope in Israel concerning this thing.”\n\nThrough diverse activities Satan is hardening the heart of men and pulling down the churches. These challenges are very present. It is\n\n Isaiah 43 verse19 to 21.\n\n“Behold, I will do a new thing; now it shall spring forth; shall ye not know it? I will even make a way in the wilderness, and rivers in the desert. The beast of the field shall honour Me, the dragons and the owls: because I give waters in the wilderness, and rivers in the desert, to give drink to My people, My chosen.\nThis people have I formed for Myself; they shall shew forth My praise.”\n\n\nOn the side of God, the light is shining and that light will cover you and lead you to heaven.\n\nPsalms 23 verse 1 to 6.\n\n“The LORD is my shepherd; I shall not want.\n\n\n He maketh me to lie down in green pastures: He leadeth me beside the still waters.  He restoreth my soul: He leadeth me in the paths of righteousness for His name's sake.\n\nYea, though I walk through the valley of the shadow of death, I will fear no evil: for Thou art with me; Thy rod and Thy staff they comfort me.\n\n Thou preparest a table before me in the presence of mine enemies: Thou anointest my head with oil; my cup runneth over. Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the LORD forever.”\n\nGod has promises for the end time. Despite the darkness of the left handside, there is the brightness of the right handside. God has made adequate provision for the end time. He will save mankind from sin and Satan. He will preserve the saints on the earth till he comes for them.\n\nJohn 10 verse 27 to 29.\n\n“My sheep hear My voice, and I know them, and they follow Me: And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of My hand. My Father, which gave them Me, is greater than all; and no man is able to pluck them out of My Father's hand.”\n\nGod will pour out His spirit upon all flesh for greater ministry. You who have committed yourself to His holiness will be blessed. You will become a great minister of Jesus Christ. The Lord wants to transform and anoint you. He wants to change your status.\n\nJoel 2 verse 28 to 29\n\n “And it shall come to pass afterward, that I will pour out My spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions: And also upon the servants and upon the handmaid sin those days will I pour out My spirit.”\n\n\n9.1\tYou Will Receive the Spirit Anointing for Exploit\n\nThe Lord has chosen you and He is going to pour out the Holy Ghost and special anointing on you for His end time assignment. Therefore, get ready for the anointing of the Holy Ghost. He wants you to prophesy. You will prophesy; you will stand upon the mountains and prophesy; you will climb up on top of houses and prophesy; you will go in the vehicles and prophesy. By your prophecy, there shall be end time salvation and world revival in the name of Jesus. That is what God will do. As for this gospel, it shall be preached in all the world.\n\nOne of the coordinators shared with me a revelation God gave him. He said we were in a vehicle with Jesus going round the world. The Holy Spirit was the driver. As we were passing through Africa, crowds of people were following us. Then we moved to Asia, crowds of people followed us. We turned to America and to Europe and even to Australia. He said when he saw the crowd in Australia, the Lord said, “I will do something special in this continent.”\n\nActs 14 verse 1.\n\n“And it came to pass in Iconium, that they went both together into the synagogue of the Jews, and so spake, that a great multitude both of the Jews and also of the Greeks believed’.\n\n\nYou are one of the people anointing is coming upon, in the name of Jesus.\n\n\nMatthew 24 verse 14\n\n“And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come”.\n\nSome of you think when the scripture says,\n\n“This gospel of the kingdom shall be preached in all the world,” it means everybody will repent in the world. Not so; it is for a witness unto them, not their total conversion. But some shall hear and repent. Then the end shall come.\n\n\nEzekiel 12 verse 26 to 28\n\n“Again the word of the LORD came to me, saying, Son of man, behold, they of the house of Israel say, The vision that he seeth is for many days to come, and he prophesieth of the times that are far off. Therefore say unto them, Thus saith the Lord GOD; There shall none of My words be prolonged any more, but the word which I have spoken shall be done, saith the Lord GOD.”\n\n\nKnow that the time is no longer long. We are in the days of the return of the Lord. You may not have the chance to grow to adulthood before the Lord's coming. You may not have the privilege of graduating from the school you are now before the Lord's coming. You may not have the privilege of marrying before the rapture\n\n\n9.2.\tThe Wisdom of God to Save You and the Remnant \n\nThe devil is now doing his worst, both in the church and in the world. The God of heaven is the God of wisdom. He said the days shall be\nshortened. Do not think that satanic activities will dominate everywhere. No! There shall be sufficient provision for the people of God. The Lord will work against Satan in a way that he will not have access to you. You will finish your ministry and be translated to heaven. The days shall be shortened. A Sister prayed to God earnestly for the conversion of her mother! “God save my mother! God save my mother.” The Lord heard her and said, “I am going to save your mother; but when I save your mother, she shall not live long, she will die. I will take her immediately because if she stays longer, evil will over-power her.” That is God. He said concerning Israel coming out of Egypt to mount Sinai, “If I take this people through a short way to the promised land, they will face a lot of battles, and many will not be able to stand. I will take them by the way of the wilderness, because I want to preserve them.”\n\n\nMatthew 24 verse 21\n\n“For then shall be great tribulation, such as was not since the beginning of the world to this time, no, nor ever shall be. And except those days should be shortened. There should no flesh be saved: but for the elect's sake those days shall be shortened.”\n\nHe shall shorten the tribulation days of Israel to three and half years because of the intensity of suffering, being the God of wisdom, knowledge and understanding. He can shorten a man's life span or the period of his stay to avoid frustration of his faith by the wicked one. God will take the appropriate decision over you in order to frustrate the devil and grant you eternal life. Co-operate with Him in righteous and holy living.\n\nJude 24 to 25\n\n“Now unto Him that is able to keep you from falling, and to present you faultless before the presence of His glory with exceeding joy, To the only wise God our Saviour, be glory and majesty, dominion and power, both now and ever. Amen.”\n\n\n\n\n\n\n9.3.\tThe Battle Against Truth and Righteousness \n\n\nIsaiah 30 verse 8 to 11\n\n “Now go, write it before them in a table, and note it in a book, that it may be for the time to come for ever and ever: That this is a rebellious people, lying children, children that will not hear the law of the LORD: Which say to the seers, See not; and to the prophets, Prophesy not unto us right things, speak unto us smooth things, prophesy deceits: Get you out of the way, turn aside out of the path, cause the Holy One of Israel to cease from before us”\n\nHuman beings are entering into covenant with Satan. The plan is to swallow up righteousness in every corner of the earth. They want to make sure the educational system is fully handed over to Satan in such a way that no righteous child passes through school undefiled. They want to make sure business men and civil servants are handed over to Satan in such a way that no single man or woman passes through undefiled. They want to make sure that the hospital system is so polluted that no person comes to the hospital and gets out from there undefiled. They are still working, boasting and beating their hands on their chest saying, “Righteousness shall soon disappear from the earth?”\n\nThey do not know the plan of God. At the time they think they have finished their plan, we shall not be on the earth, the church would have been raptured. God said those evil days shall be shortened. If those days were not shortened the pressure would be too unbearable even for those who are born again, sanctified and holy.\n\n\nPsalm 125 verse 3\n\n“For the rod of the wicked shall not rest upon the lot of the righteous; lest the righteous will put forth their hands unto iniquity”\n\nThe man of God says, Let me not be poor Lord, less I steal and blaspheme your name.\n\nProverbs 30 verse 8 and 9\n\n“Remove far from me vanity and lies: give me neither poverty nor riches; feed me with food convenient for me: Lest I be full, and deny thee, and say, Who is the LORD? or lest I be poor, and steal, and take the name of my God in vain.”\n\nThe situation can become so terrible but the Lord says, “I will cut short the time.” The Lord will give some saints the grace to die before the enemy gets them polluted. But the rest of us will go in the rapture! Now there is a plan. Why is God calling you into Holiness Movement? It is because He wants you to be preserved and be put into holy uses.\n\n\n\n Second Timothy 2 verse19 to 21\n\n“Nevertheless the foundation of God standeth sure, having this seal, The Lord knoweth them that are His. And, Letevery one that nameth the name of Christ depart from iniquity. \n\nBut in a great house there are not only vessels of gold and of silver, but also of wood and of earth; and some to honour, and some to dishonour. If a man therefore purge himself from these, he shall be a vessel unto honour, sanctified, and meet for the master's use, and prepared unto every good work.” \n\nThe Lord wants you to be among the remnant that should serve Him without pollution in this end time. God is calling you as He called Moses.\nEzekiel 6 verse 8\n \n“Yet will I leave a remnant, that ye may have some that shall escape the sword among the nations, when ye shall be scattered through the countries.”\n\nNow God still has people to save among sinners. These include children, youths, men and women. They are the people that are sighing now for salvation from sin and Satan. The Lord has seen them and wants to save them. That is why He is calling people like you for end time revival.\n\nExodus 3 verse 9 and10\n\n “Now therefore, behold, the cry of the children of Israel is come unto Me: and I have also seen the oppression wherewith the Egyptians oppress them. Come now therefore, and I will send thee unto Pharaoh, that thou mayest bring forth My people the children of Israel out of Egypt.”\n\n\nThere are still churches that can be revived through hearing God's word. I heard of a church; I think it is in Enugu State of Nigeria.\n\nThe pastor received with joy this word of holiness and righteousness in one of our crusades. He took the message to his church wondering, “Will my church scatter if I preach this message? “That was his fear. But the Lord has spoken who will restrain it? We cannot but speak the things which we have heard and seen. He went to his church and declared this truth. When he preached this word of righteousness and holiness, (maybe he was doing this shivering), the church members rose up and said, “Pastor, that is what we have been waiting for; we are ready! That is what we need. We shall go with it!” I learned that about twelve of those women came to Holiness Conference. A remnant shall be saved! That is what is going to happen everywhere.\n\nThe people that love God are still in the churches and in the world. That is why God is raising you up. He wants you to do a final work of salvation among men before the rapture will take place. He will fill you with anointing and power for evangelism and soul winning.\n\nJohn 10 verse 16\n\n“And other sheep I have, which are not of this fold: them also I must bring, and they shall hear My voice; and there shall be one fold, and one shepherd.”\n\nThe Lord wants to see true Christian women who are all out for endtime revival. Are you one of them, Sister? Please offer yourself to God to make you one of them\n\nIsaiah 6 verse 8\n\n“Also I heard the voice of the Lord, saying, Whom shall I send, and who will go for Us? Then said I, Here am I; send me.”\n\nLet everybody see you as a woman who has pledged to bring about end time revival. Mobilize other Christian women for this purpose to ensure the revival of truth, righteousness and holiness. Mobilize women that have bonded themselves for end time revival in the church, in every community and institution. May the Lord lay His hand upon you; may the Lord pour out His Spirit upon you. We need a revival, end time revival. Souls must be saved from entering hell fire. The church must arise to Christ's truth and be restored to his righteousness and holiness. Satan must be bound, and the remnant must be saved and preserved in the Lord for the rapture.\n\n9.4\tGod Demands for Prayers\n\nTo make this happen, God is calling on you to pray it in.\n\nIsaiah 62 verse1 to 7\n\n“For Zion's sake will I not hold My peace,and for Jerusalem's sake I will not rest,until the righteousness thereof go forth as brightness,and the salvation thereof as a lamp that burneth.\n\nAnd the Gentiles shall see thy righteousness, and all kings thy glory: and thou shalt be called by a new name, which the mouth of the LORD shall name. Thou shalt also be a crown of glory in the hand of the LORD, and a royal diadem in the hand of thy God. Thou shalt no more be termed Forsaken; neither shall thy land any more be termed Desolate: but thou shalt be called Hephzibah, and thy land Beulah: for the LORD delighteth in thee, and thy land shall be married. For as a young man marrieth a virgin, so shall thy sons marry thee: and as the bridegroom rejoiceth over the bride, so shall thy God rejoice over thee. I have set watchmen upon thy walls, O Jerusalem, which shall never hold their peace day nor night: ye that make mention of the LORD, keep not silence, And give Him no rest, till He establish, and till He make Jerusalem a praise in the earth.” \n\n\nThe Lord wants to do a special thing upon the earth. He wants to do a special work in the church. It is end time harvest, the final revival in preparation for the rapture. That is why He wants prayers. He has called you to pray so that He will do a special work of revival. In many instances, God limits himself to prayers.\n\n\nJeremiah 29 verse11 and12\n\n“For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end. Then shall ye call upon Me, and ye shall go and pray unto Me, and I will hearken unto you.”\n\nHe says, “Pray and I will hear you. I know what I want to do but you pray. I know what to do for those people, but you pray. I know how to enter that nation, but you pray. I know how to enter into that tribe and cause My salvation there, but you pray. I know how to enter that church and bring transformation and pull down the walls of darkness in that church, but you pray.” The Lord is calling you to prayer. The Lord knows what to do in that religion. “I know how to break the backbone of Islamic religion, but I want you to pray. I will hear you. Call upon Me and I will answer you. I will do wonders; I will do great things, marvellous things in your eyes!” So the Lord is calling for prayer warriors that will pray-in final revival. That is why He chose you. This is your calling and you are receiving anointing for it. May the Lord put the spirit of prayer in your life in the name of Jesus; the prayer that will bring revival to America, Europe, Africa and cause the light of God to shine in Asia.\n\n\n9.5\tArise as in the Days of Deborah\n\nGod is calling for his daughters to arise as in the days of Deborah. The men are afraid; the men are away from the churches; the men are asleep; that is why God is calling on the women to come forward. Your Creator sees you with dignity. Your God recognizes you. You don't see the men in the churches; you don't see them zealous for God any more. Since the men are asleep and have given chance to the devil, the Lord now says, “Where are My daughters?” As in the days of Deborah, you will rise and do great things in the name of Jesus. Deborah sang a song because in her days, the men were afraid; in her days, the men were away; in her days, the men were asleep.\n\n\nJudges 5 verse1and 2\n\n“Then sang Deborah and Barak the son of Abinoam on that day, saying, Praise ye the LORD for the avenging of Israel, when the people willingly offered themselves.”\n\nIt is your time to arise, because the men have sold the church to Satan. They have gone for magic; they have gone for money; they have gone for other things. They are corrupting the church; they are making covenant with Satan and are sending people to hell. God says, you should arise, Deborah. Awake! Awake!! Awake!!! Let the spirit of Deborah come upon you. The Lord is pouring the spirit of Deborah upon last days' women. You will be a great preacher; you will be a great gospel teacher; you will be a great warrior. I say you will recover the church, woman! You will bring revival to the world. That is why the Lord is calling on you.\n\n9.6\tTrue Men Are Few\n\nMatthew 9 verse 35 to 38\n\n “And Jesus went about all the cities and villages, teaching in their synagogues, and preaching the gospel of the kingdom, and healing every sickness and every disease among the people. But when He saw the multitudes, He was moved with compassion on them, because they fainted, and were scattered abroad, as sheep having no shepherd. Then saith He unto His disciples, The harvest truly is plenteous, but the labourers are few; Pray ye therefore the Lord of the harvest, that He will send forth labourers into His harvest.”\n\nThe few men that are there are not sufficient for the great harvest. The burden is too great for them. The Moseses that are leading the work are now complaining, “Can I do all these things alone?” The few men that are there are sighing for help since their fellow men are not there; their fellow men have gone after Satan. They have entered into contract with Satan. The men are saying like Moses. “Oh Lord did I give birth to all these people? Why have you put this great burden upon me alone?” The men are not there, but the women are there!\n\nWoman, are you there? The Lord has turned to you, to help to bear the burden with the few men available. Revival must come! Yes, that is what the Lord is saying; that is what God is doing at this end time. Awake, Deborah of our generation; awake ye daughter of the Lord; awake ye mothers and sisters in the church. Arise and play your role for the game is on you now. We are watching you; angels also are watching you. The devil that despised you shall fear you. The devil that said, “Who are you? You are just a common woman,” shall go on the run. You will do exploits for Jesus. That is what the LORD desires of you.\nGo, recover the souls of men and women; go, recover the truth; go, recover righteousness; go, recover holiness in preparation for the coming of Jesus.\n\nThis involves risk, but you are our Esther. Our eyes are upon you, Esther. Take the risk. Even at your life's expense. Take the risk, these people must be delivered; the devil must be overturned! Haman and all his people must be wiped out. Many of the people of the land must become Christians. The people in your community shall become Christians. I say, take the risk. Are you ready to take the risk? Then the Lord shall be with you; you will cut off the head of Goliath. Pharaoh shall bow before you. Rise upon your feet, the Lord has laid His hand upon you.\n\nAct 26 verse15 to19\n\n“And I said, Who art thou, Lord? And He said, I am Jesus whom thou persecutest. But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee; Delivering thee from the people, and from the Gentiles, unto whom now I send thee, To open their eyes, and to turn them from darkness to light, and from the power of Satan unto God, that they may receive forgiveness of sins, and inheritance among them which are sanctified by faith that is in Me. \nWhereupon, O king Agrippa, I was not disobedient unto the heavenly vision:” \n\nIt is now time that women must go for this work. You must go for the Lord. You are a vessel of honour unto God. He has made you for Himself and the days for your exploit have come. These are the days of your performance, the days of your glory. It is time now to give glory to your Creator. The men are afraid, the men are away; yes, the men are asleep. The few that are there, the burden is too much for them. Rise up and work, open your mouth and say, “Lord here am I. I shall work and bring forth revival before the rapture comes.”\n\nFirst Corinthians 9 verse16 to17\n\n “For though I preach the gospel, I have nothing to glory of: for necessity is laid upon me; yea, woe is unto me, if I preach not the gospel!\n\n For if I do this thing willingly, I have a reward: but if against my will, a dispensation of the gospel is committed unto me.”\n\n\n9.7.\tMy Intersession for You and Other Women \n\nI want to make intercession for you before the Lord. Just raise up your hand. I am making intercession for you who have read this message from the Lord this day in the name of Jesus!\n\nAlmighty Father, I commit this woman unto you; she is your daughter. We have seen that the Lord Jesus is already on the way. We have known that we are the generation that will see the Lord come to take us home in the rapture. Oh Lord, the world lies immensely in ignorance, the church is backslidden. Lord God, what a challenge! Satanic activities fill everywhere. The men are away from the church, the men are afraid, the men are asleep. Lord, the few that are there are saying the work is too much for them. God turn to your women; Lord turn to the women! Let the power of the Lord come upon the women; take them over, in the name of Jesus! Like in the days of Deborah, when the men were afraid to walk on the high ways, because of their enemies and they were hiding and following the bush paths until Deborah arose. I pray for special anointing for the Deborah that is before you now.\n\nO Lord, let Deborah in Christ receive anointing. Let the anointing of the Lord rest upon you; let the power of God rest upon you; let the grace of God rest upon you. Let the Holy Ghost anointing rest upon you. Receive, in the name of Jesus. Almighty Father, in her corner, in her church, in her denomination, wherever she is, revival shall spring up there. Oh God, receive this Sister in the name of Jesus! Woman, receive the anointing, receive the grace of God. Let your eyes open, let understanding be given you. Receive the wisdom of the gospel; receive power over Satan and demons. Receive the power for signs and wonders, in the name of Jesus. Lift up your voice and thank the Lord, lift up your voice and worship the Lord. The Lord has enrolled you and has counted you in the number; the Lord has put His Spirit upon your life! Thank Jesus.\n\n9.8\tThe Promises of God for Your ministry\n\n\nJeremiah 1 verse 4 to12\n\n“Then the word of the LORD came unto me, saying, Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations. Then said I, Ah, Lord GOD! behold, I cannot speak: for I am a child.\n\n7 But the LORD said unto me, Say not, I am a child: for thou shalt go to all that I shall send thee, and whatsoever I command thee thou shalt speak. Be not afraid of their faces: for I am with thee to deliver thee, saith the LORD.\n\n9 Then the LORD put forth His hand, and touched my mouth. And the LORD said unto me, Behold, I have put My words in thy mouth.\n See, I have this day set thee over the nations and over the kingdoms, to root out, and to pull down, and to destroy, and to throw down, to build, and to plant. 11 Moreover the word of the LORD came unto me, saying, Jeremiah, what seest thou? And I said, I see a rod of an almond tree. 12 Then said the LORD unto me, Thou hast well seen: for I will hasten My word to perform it.\n\n\nJudges 6 verse 12 to14\n\n12 And the angel of the LORD appeared unto him, and said unto him, The LORD is with thee, thou mighty man of valour. 13 And Gideon said unto him, Oh my Lord, if the LORD be with us, why then is all this befallen us? and where be all His miracles which our fathers told us of, saying, Did not the LORD bring us up from Egypt? but now the LORD hath forsaken us, and delivered us into the hands of the Midianites. 14 And the LORD looked upon him, and said, Go in this thy might, and thou shalt save Israel from the hand of the Midianites: have not I sent thee?\n\nJoshua 1 verse 1 to 9\n\n“Now after the death of Moses the servant of the LORD it came to pass, that the LORD spake unto Joshua the son of Nun, Moses' minister, saying, Moses My servant is dead; now therefore arise, go over this Jordan, thou, and all this people, unto the land which I do give to them, even to the children of Israel. Every place that the sole of your foot shall tread upon, that have I given unto you, as I said unto Moses.\nFrom the wilderness and this Lebanon even unto the great river, the river Euphrates,all the land of the Hitites, and unto the great sea toward the going down of the Sun , shall be your coast.\n\n There shall not any man be able to stand before thee all the days of thy life: as I was with Moses, so I will be with thee: I will not fail thee, nor forsake thee. Be strong and of a good courage: for unto this people shalt thou divide for an inheritance the land, which I sware unto their fathers to give them.\n\n Only be thou strong and very courageous, that thou mayest observe to do according to all the law, which Moses My servant commanded thee: turn not from it to the right hand or to the left, that thou mayest prosper whithersoever thou goest.\n\n This book of the law shall not depart out of thy mouth; but thou shalt meditate therein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.\n\n\n Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the LORD thy God is with thee whithersoever thou goest.\n\nWhen you finish your service on earth, you will go to heaven peacefully, joyfully, victoriously, to receive great reward. Amen, so shall it be.”\n\n\nSecond Timothy 4 verse 6 to 8\n\n“For I am now ready to be offered, and the time of my departure is at hand. I have fought a good fight, I have finished my course, I have kept the faith:  Henceforth there is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day: and not to me only, but unto all them also that love His appearing.”\n\n\nPastor Paul Rika\n\n\n\n\n\n\n",
    "summary": "this is a short book",
    "authorpic": "",
    "authorinfo": "Pastor paul rika is an end time Gospel preacher Pastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacherPastor paul rika is an end time Gospel preacher"
  }
]